{
    "aboutTitle": "About Me - Haichuan Yu's Personal Website",
    "aboutDescription": "I am Haichuan Yu, a mechanical engineer from Qingdao, China, passionate about technology and innovation. Currently residing in Böblingen, Germany, I work at Bertrandt AG, primarily involved in the development and testing of automotive electronic control units and the R&D of prototype vehicles for OEMs. I love technological innovation and enjoy solving practical problems through programming and data analysis.",
    "aboutExperience": "Below is my personal education, life, and work experience:",
    "qingdao": "Qingdao",
    "germany": "Germany",
    "HighEducation": "Higher Education",
    "GuangzhouSCUT": "Guangzhou, China - South China University of Technology - Bachelor of Mechanical Engineering",
    "KarlsruheKIT": "Karlsruhe, Germany - Karlsruhe Institute of Technology - Bachelor and Master of Mechanical Engineering",
    "skills": "Skills and Expertise",
    "skill1": "Principles and Applications of Vibration",
    "skill2": "Mechanical Design and Simulation",
    "skill3": "Testing and Development of Automotive Electronic Control Units",
    "skill4": "German and Chinese driver's licenses, with over 100,000 kilometers of driving experience",
    "skill5": "Proficient in Chinese, English, and German",
    "skill6": "Programming Languages: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Below is my skills matrix, where three checkmarks indicate proficiency and one checkmark indicates basic understanding and ability to perform some fundamental operations:",
    "interests": "Interests and Hobbies",
    "interestsDescription": "I enjoy island travel, playing Go against computers, watching action and sci-fi movies, programming with AI, listening to Chinese pop music, and exploring new technologies.",
    "myKita": "My Kindergarten: Qingdao Preschool Normal School Affiliated Kindergarten",
    "myKitaDescription": "Near Qingdao University, sharing Ultraman dolls with my friends was the starting point of my childhood",
    "visitKita": "Visit the kindergarten's official website",
    "myPrimary": "My primary school: Qingdao New Century School",
    "myPrimaryDescription": "From 2000 to 2006, I spent a happy primary school time here. My grades were among the best in the class, and I was well-rounded in moral, intellectual, physical, aesthetic and labor aspects. I once represented the school in the district sports meet.",
    "visitPrimary": "Visit the official website of New Century School",
    "myJuniorHigh": "My junior high school: Qingdao Chaoyin Middle School",
    "myJuniorHighDescription": "After three years of training here, I have laid a solid foundation for learning. I have served as the class safety committee member, physics class representative and other positions. I have represented the class and school in programming competition training and English proficiency competitions, and became one of the only two outstanding graduates in the class who were admitted to Qingdao No. 2 Middle School.",
    "visitJuniorHigh": "Visit the official website of Qingdao Chaoyin Middle School",
    "myHighSchool": "My high school: Qingdao No.2 High School",
    "myHighSchoolDescription": "At the foot of Cigui Mountain and beside Jingsi Lake, I spent my youthful years as a passionate young man. I spent a busy but fulfilling high school life here and was admitted to my ideal university with a score of 646 in the college entrance examination.",
    "visitHighSchool": "Visit the official website of Qingdao No.2 High School",
    "boeblingenTitle": "Böblingen",
    "boeblingenDescription": "I currently live in Böblingen, a charming small town with winding streets. The city of Sindelfingen, located to the north, is home to Mercedes-Benz's largest factory.",
    "visitBoeblingenWebsite": "Visit Böblingen City Website",
    "karlsruheTitle": "Karlsruhe",
    "karlsruheDescription": "I spent ten years of my life in this city, from my 20s to my 30s, and it has become my second home. From my initial naivety upon arriving in Germany, attending language classes, learning German, completing my bachelor's and master's degrees in mechanical engineering at the Karlsruhe Institute of Technology, obtaining a German driver's license, falling in love, getting married, and having a daughter, this city has witnessed a memorable decade of my life.",
    "visitKITWebsite": "Visit Karlsruhe Institute of Technology Website",
    "herzogenaurachTitle": "Herzogenaurach",
    "herzogenaurachDescription": "This city is home to Schaeffler AG, a renowned supplier in the mechanical engineering industry. I completed my mandatory internship in the drivetrain research and development department here during my bachelor's studies.",
    "visitSchaefflerWebsite": "Visit Schaeffler Website",
    "koblenzTitle": "Koblenz",
    "koblenzDescription": "This famous German tourist city, located by the Rhine River and home to the Deutsches Eck (German Corner), is the headquarters of Stabilus, a manufacturing company specializing in air springs and dampers. I completed my voluntary internship in the innovation and research department here during my master's studies.",
    "visitKoblenzWebsite": "Visit Koblenz City Website",
    "hannoverTitle": "Hannover",
    "hannoverDescription": "The Hannover Messe is Germany's largest industrial trade fair. In my spare time, I had the privilege of representing a domestic company at the exhibition, which was a rewarding experience.",
    "visitHannoverMesseWebsite": "Visit Hannover Messe Website",
    "duesseldorfTitle": "Düsseldorf",
    "duesseldorfDescription": "The Düsseldorf Metallurgy Exhibition is Europe's largest metallurgy trade fair. In 2019, I had the opportunity to attend the exhibition and experience the charm of this international metropolis.",
    "visitDuesseldorfMesseWebsite": "Visit Düsseldorf Messe Website"
  }