{
  "en": {
    "aboutTitle": "About Me - Haichuan Yu's Personal Website",
    "aboutDescription": "I am Haichuan Yu, a mechanical engineer from Qingdao, China, passionate about technology and innovation. Currently residing in Böblingen, Germany, I work at Bertrandt AG, primarily involved in the development and testing of automotive electronic control units and the R&D of prototype vehicles for OEMs. I love technological innovation and enjoy solving practical problems through programming and data analysis.",
    "aboutExperience": "Below is my personal education, life, and work experience:",
    "qingdao": "Qingdao",
    "germany": "Germany",
    "HighEducation": "Higher Education",
    "GuangzhouSCUT": "Guangzhou, China - South China University of Technology - Bachelor of Mechanical Engineering",
    "KarlsruheKIT": "Karlsruhe, Germany - Karlsruhe Institute of Technology - Bachelor and Master of Mechanical Engineering",
    "skills": "Skills and Expertise",
    "skill1": "Principles and Applications of Vibration",
    "skill2": "Mechanical Design and Simulation",
    "skill3": "Testing and Development of Automotive Electronic Control Units",
    "skill4": "German and Chinese driver's licenses, with over 100,000 kilometers of driving experience",
    "skill5": "Proficient in Chinese, English, and German",
    "skill6": "Programming Languages: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Below is my skills matrix, where three checkmarks indicate proficiency and one checkmark indicates basic understanding and ability to perform some fundamental operations:",
    "interests": "Interests and Hobbies",
    "interestsDescription": "I enjoy island travel, playing Go against computers, watching action and sci-fi movies, programming with AI, listening to Chinese pop music, and exploring new technologies.",
    "myKita": "My Kindergarten: Qingdao Preschool Normal School Affiliated Kindergarten",
    "myKitaDescription": "Near Qingdao University, sharing Ultraman dolls with my friends was the starting point of my childhood",
    "visitKita": "Visit the kindergarten's official website",
    "myPrimary": "My primary school: Qingdao New Century School",
    "myPrimaryDescription": "From 2000 to 2006, I spent a happy primary school time here. My grades were among the best in the class, and I was well-rounded in moral, intellectual, physical, aesthetic and labor aspects. I once represented the school in the district sports meet.",
    "visitPrimary": "Visit the official website of New Century School",
    "myJuniorHigh": "My junior high school: Qingdao Chaoyin Middle School",
    "myJuniorHighDescription": "After three years of training here, I have laid a solid foundation for learning. I have served as the class safety committee member, physics class representative and other positions. I have represented the class and school in programming competition training and English proficiency competitions, and became one of the only two outstanding graduates in the class who were admitted to Qingdao No. 2 Middle School.",
    "visitJuniorHigh": "Visit the official website of Qingdao Chaoyin Middle School",
    "myHighSchool": "My high school: Qingdao No.2 High School",
    "myHighSchoolDescription": "At the foot of Cigui Mountain and beside Jingsi Lake, I spent my youthful years as a passionate young man. I spent a busy but fulfilling high school life here and was admitted to my ideal university with a score of 646 in the college entrance examination.",
    "visitHighSchool": "Visit the official website of Qingdao No.2 High School",
    "boeblingenTitle": "Böblingen",
    "boeblingenDescription": "I currently live in Böblingen, a charming small town with winding streets. The city of Sindelfingen, located to the north, is home to Mercedes-Benz's largest factory.",
    "visitBoeblingenWebsite": "Visit Böblingen City Website",
    "karlsruheTitle": "Karlsruhe",
    "karlsruheDescription": "I spent ten years of my life in this city, from my 20s to my 30s, and it has become my second home. From my initial naivety upon arriving in Germany, attending language classes, learning German, completing my bachelor's and master's degrees in mechanical engineering at the Karlsruhe Institute of Technology, obtaining a German driver's license, falling in love, getting married, and having a daughter, this city has witnessed a memorable decade of my life.",
    "visitKITWebsite": "Visit Karlsruhe Institute of Technology Website",
    "herzogenaurachTitle": "Herzogenaurach",
    "herzogenaurachDescription": "This city is home to Schaeffler AG, a renowned supplier in the mechanical engineering industry. I completed my mandatory internship in the drivetrain research and development department here during my bachelor's studies.",
    "visitSchaefflerWebsite": "Visit Schaeffler Website",
    "koblenzTitle": "Koblenz",
    "koblenzDescription": "This famous German tourist city, located by the Rhine River and home to the Deutsches Eck (German Corner), is the headquarters of Stabilus, a manufacturing company specializing in air springs and dampers. I completed my voluntary internship in the innovation and research department here during my master's studies.",
    "visitKoblenzWebsite": "Visit Koblenz City Website",
    "hannoverTitle": "Hannover",
    "hannoverDescription": "The Hannover Messe is Germany's largest industrial trade fair. In my spare time, I had the privilege of representing a domestic company at the exhibition, which was a rewarding experience.",
    "visitHannoverMesseWebsite": "Visit Hannover Messe Website",
    "duesseldorfTitle": "Düsseldorf",
    "duesseldorfDescription": "The Düsseldorf Metallurgy Exhibition is Europe's largest metallurgy trade fair. In 2019, I had the opportunity to attend the exhibition and experience the charm of this international metropolis.",
    "visitDuesseldorfMesseWebsite": "Visit Düsseldorf Messe Website"
  },
  "de": {
    "aboutTitle": "Über mich - Haichuan Yus persönliche Website",
    "aboutDescription": "Ich bin Haichuan Yu, ein Maschinenbauingenieur aus Qingdao, China, der sich für Technologie und Innovation begeistert. Derzeit wohne ich in Böblingen, Deutschland, und arbeite bei Bertrandt AG, hauptsächlich an der Entwicklung und Prüfung von elektronischen Steuergeräten für Fahrzeuge sowie an der Forschung und Entwicklung von Prototypenfahrzeugen für OEMs. Ich liebe technologische Innovationen und löse gerne praktische Probleme durch Programmierung und Datenanalyse.",
    "aboutExperience": "Hier sind meine persönlichen Bildungs-, Lebens- und Berufserfahrungen:",
    "qingdao": "Qingdao",
    "germany": "Deutschland",
    "HighEducation": "Hochschulbildung",
    "GuangzhouSCUT": "Guangzhou, China - Südchinesische Technische Universität - Bachelor Maschinenbau",
    "KarlsruheKIT": "Karlsruhe, Deutschland - Karlsruher Institut für Technologie - Bachelor und Master Maschinenbau",
    "skills": "Fähigkeiten und Expertise",
    "skill1": "Prinzipien und Anwendungen der Schwingungslehre",
    "skill2": "Maschinelles Design und Simulation",
    "skill3": "Prüfung und Entwicklung von elektronischen Steuergeräten für Fahrzeuge",
    "skill4": "Deutscher und chinesischer Führerschein, mit über 100.000 Kilometern Fahrerfahrung",
    "skill5": "Fließend in Chinesisch, Englisch und Deutsch",
    "skill6": "Programmiersprachen: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Hier ist meine Fähigkeitsmatrix, wobei drei Häkchen für fortgeschrittene Kenntnisse und ein Häkchen für grundlegendes Verständnis und die Fähigkeit zur Durchführung einiger grundlegender Operationen stehen:",
    "interests": "Interessen und Hobbys",
    "interestsDescription": "Ich genieße Inselreisen, spiele Go gegen Computer, schaue Action- und Science-Fiction-Filme, programmiere mit KI, höre chinesische Popmusik und erkunde neue Technologien.",
    "myKita": "Mein Kindergarten: Angeschlossener Kindergarten der Qingdao Preschool Normal School",
    "myKitaDescription": "In der Nähe der Universität Qingdao war das Teilen von Ultraman-Puppen mit meinen Freunden der Ausgangspunkt meiner Kindheit",
    "visitKita": "Besuchen Sie die offizielle Website des Kindergartens",
    "myPrimary": "Meine Grundschule: Qingdao New Century School",
    "myPrimaryDescription": "Von 2000 bis 2006 habe ich hier eine schöne Grundschulzeit verbracht. Meine schulischen Leistungen gehören zu den besten meiner Klasse und ich verfügte über umfassende moralische, intellektuelle, körperliche, ästhetische und berufliche Fähigkeiten. Ich habe die Schule bei Bezirkssportveranstaltungen vertreten.",
    "visitPrimary": "Besuchen Sie die offizielle Website von New Century School",
    "myJuniorHigh": "Meine Mittelschule: Qingdao Chaoyin Mittelschule",
    "myJuniorHighDescription": "Nach drei Jahren Ausbildung hier habe ich eine solide Grundlage für mein Lernen gelegt. Ich war Mitglied des Klassensicherheitsausschusses, Klassensprecher für Physik und übte weitere Positionen aus. Ich habe die Klasse und die Schule bei Programmierwettbewerben und Englisch-Leistungswettbewerben vertreten und bin einer von nur zwei herausragenden Absolventen meiner Klasse, die an der Qingdao-Mittelschule Nr. 2 aufgenommen wurden.",
    "visitJuniorHigh": "Besuchen Sie die offizielle Website von Qingdao Chaoyin Middle School",
    "myHighSchool": "Meine Oberschule: Qingdao Nr.2 Oberschule",
    "myHighSchoolDescription": "Am Fuße des Cigui-Berges und neben dem Jingsi-See verbrachte ich meine Jugend als leidenschaftlicher junger Mann. Ich hatte hier ein arbeitsreiches, aber erfülltes Oberschule-Leben und wurde mit einer Punktzahl von 646 (insgesmat 750 Punkte) in der College-Aufnahmeprüfung (Abitur) an meiner Traumuniversität zugelassen.",
    "visitHighSchool": "Besuchen Sie die offizielle Website von Qingdao Nr.2 Oberschule",
    "boeblingenTitle": "Böblingen",
    "boeblingenDescription": "Ich lebe derzeit in Böblingen, einer charmanten Kleinstadt mit verwinkelten Straßen. Die Stadt Sindelfingen im Norden beherbergt das größte Werk von Mercedes-Benz.",
    "visitBoeblingenWebsite": "Besuchen Sie die Website der Stadt Böblingen",
    "karlsruheTitle": "Karlsruhe",
    "karlsruheDescription": "Ich habe zehn Jahre meines Lebens in dieser Stadt verbracht, von meinen 20ern bis zu meinen 30ern, und sie ist zu meiner zweiten Heimat geworden. Von meiner anfänglichen Naivität bei meiner Ankunft in Deutschland, dem Besuch von Sprachkursen, dem Erlernen der deutschen Sprache, dem Abschluss meines Bachelor- und Masterstudiums in Maschinenbau am Karlsruher Institut für Technologie, dem Erwerb eines deutschen Führerscheins, dem Verlieben, Heiraten und der Geburt einer Tochter hat diese Stadt ein denkwürdiges Jahrzehnt meines Lebens miterlebt.",
    "visitKITWebsite": "Besuchen Sie die Website des Karlsruher Instituts für Technologie",
    "herzogenaurachTitle": "Herzogenaurach",
    "herzogenaurachDescription": "Diese Stadt ist der Sitz von Schaeffler AG, einem renommierten Zulieferer in der Maschinenbaubranche. Ich habe hier mein Pflichtpraktikum in der Antriebsstrang-Forschung und -Entwicklung während meines Bachelorstudiums absolviert.",
    "visitSchaefflerWebsite": "Besuchen Sie die Schaeffler-Website",
    "koblenzTitle": "Koblenz",
    "koblenzDescription": "Diese berühmte deutsche Touristenstadt, am Rhein gelegen und Heimat des Deutschen Ecks, ist der Hauptsitz von Stabilus, einem Hersteller von Luftfedern und Dämpfern. Ich habe hier mein freiwilliges Praktikum in der Innovations- und Forschungsabteilung während meines Masterstudiums absolviert.",
    "visitKoblenzWebsite": "Besuchen Sie die Website der Stadt Koblenz",
    "hannoverTitle": "Hannover",
    "hannoverDescription": "Die Hannover Messe ist die größte Industriemesse Deutschlands. In meiner Freizeit hatte ich das Privileg, ein inländisches Unternehmen auf der Messe zu vertreten, was eine bereichernde Erfahrung war.",
    "visitHannoverMesseWebsite": "Besuchen Sie die Hannover Messe Website",
    "duesseldorfTitle": "Düsseldorf",
    "duesseldorfDescription": "Die Düsseldorfer Metallurgieausstellung ist die größte Metallurgiemesse Europas. Im Jahr 2019 hatte ich die Gelegenheit, die Ausstellung zu besuchen und den Charme dieser internationalen Metropole zu erleben.",
    "visitDuesseldorfMesseWebsite": "Besuchen Sie die Düsseldorfer Messe Website"
  },
  "zh": {
    "aboutTitle": "关于我 - 余海川的个人网站",
    "aboutDescription": "我是余海川，一名来自中国青岛，热爱技术和创新的机械工程师，目前居住在德国伯布林根，在Bertrandt AG工作，主要从事汽车电子控制单元的开发测试以及主机厂原型车辆的研发相关工作。我热爱技术创新，喜欢通过编程和数据分析解决实际问题。",
    "aboutExperience": "以下是我的个人教育，生活及工作经历:",
    "qingdao": "青岛",
    "germany": "德国",
    "HighEducation": "高等教育经历",
    "GuangzhouSCUT": "中国广州 - 华南理工大学 - 机械工程学士",
    "KarlsruheKIT": "德国卡尔斯鲁厄 - 卡尔斯鲁厄理工学院 - 机械工程学士及硕士",
    "skills": "技能与专长",
    "skill1": "震荡学原理与应用",
    "skill2": "机械设计与仿真",
    "skill3": "汽车电子控制单元测试与开发",
    "skill4": "德国及中国驾照，驾驶里程累计超过10万公里",
    "skill5": "熟练掌握并应用中文英文德语三种语言",
    "skill6": "编程语言：MATLAB, Python, CANoe，DTS Monaco，JavaScript",
    "skillsMatrixDescription": "以下是我的能力矩阵，三个对号为熟练掌握及应用，一个对号为了解基本原理并可以进行一些基础操作：",
    "interests": "兴趣与爱好",
    "interestsDescription": "我喜欢海岛旅行，与电脑对弈，欣赏动作科幻电影，利用AI编程，听华语流行音乐，热衷于探索新技术。",
    "myKita": "我的幼儿园:青岛幼儿师范学校附属幼儿园",
    "myKitaDescription": "临近青岛大学，与小盆友们分享奥特曼玩偶，是我童年的起点。",
    "visitKita": "访问幼儿园官网",
    "myPrimary": "我的小学:青岛新世纪学校",
    "myPrimaryDescription": "2000-2006, 我在这里度过了快乐的小学时光。成绩名列班级前茅，德智体美劳全面发展，曾代表学校参加区级运动会。",
    "visitPrimary": "访问新世纪官网",
    "myJuniorHigh": "我的初中：青岛超银中学",
    "myJuniorHighDescription": "我在这里经过了三年的锤炼，打下了扎实的学习基础，曾历任班级安全委员，物理课代表等职务，代表班级和学校参加编程竞赛培训以及英语能力竞赛，并且成为班级里唯二考入青岛二中的优秀毕业生。",
    "Qingdao Chaoyin Middle School": "访问超银官网",
    "myHighSchool": "我的高中：青岛二中",
    "myHighSchoolDescription": "慈龟山下，静思湖畔，留下了热血少年青葱的岁月，我在这里度过了紧张而又充实的高中生活，以优异的成绩考入理想的大学。",
    "visitHighSchool": "访问二中官网",
    "boeblingenTitle": "伯布林根",
    "boeblingenDescription": "我目前居住在伯布林根，市区街道蜿蜒起伏，是一个别有韵味的小城。城市北边的辛德芬根坐落着梅赛德斯奔驰最大的工厂。",
    "visitBoeblingenWebsite": "访问伯布林根市官网",
    "karlsruheTitle": "卡尔斯鲁厄",
    "karlsruheDescription": "我在这座城市度过了20到30岁的十年时光。从刚到德国的懵懂无知，入学语言班，学习德语，就读于卡尔斯鲁厄机械制造专业本科及研究生并顺利毕业。",
    "visitKITWebsite": "访问卡尔斯鲁厄理工学院官网",
    "herzogenaurachTitle": "黑尔措根奥拉赫",
    "herzogenaurachDescription": "这座城市坐落着著名机械制造行业供应商舍弗勒公司，我在这里的转动轴研发部门完成了机械制造专业本科阶段的义务实习。",
    "visitSchaefflerWebsite": "访问舍弗勒公司官网",
    "koblenzTitle": "科布伦茨",
    "koblenzDescription": "林河旁边的这座德国著名的旅游城市，德国之角所在地，是斯泰必鲁斯公司的总部。这是一家生产空气弹簧及阻尼器等的制造企业。我在这里的创新研发部门完成了机械制造研究生阶段的自由实习。",
    "visitKoblenzWebsite": "访问科布伦茨城市官网",
    "hannoverTitle": "汉诺威",
    "hannoverDescription": "汉诺威展览是德国最大的工业展览，在课余时间我有幸代表国内企业参展，收获颇丰。",
    "visitHannoverMesseWebsite": "访问汉诺威展览官网",
    "duesseldorfTitle": "杜塞尔多夫",
    "duesseldorfDescription": "杜塞尔多夫冶金展是欧洲最大的冶金展览。2019年我有幸参展的同时，也领略这座国际化大都市的风采。",
    "visitDuesseldorfMesseWebsite": "访问杜塞尔多夫冶金展官网"
  }
}