{
  "en": {
    "academicTitle":"Academic Achievements - Haichuan Yu's Personal Website",
    "qingdaoHighSchool": "Qingdao No. 2 High School (September 2009 - June 2012)",
    "september2009": "September 2009",
    "qingdaoEntrance": "In the 2009 high school entrance exam, I scored 602 points (out of 650) and was admitted to Qingdao No. 2 High School from Chaoyin Middle School. I was assigned to Class 5 of Grade 10 and began my high school life.",
    "september2010": "September 2010",
    "scienceChoice": "I chose the science major.",
    "june2011": "June 2011",
    "highSchoolIntern": "I did a short metalworking internship in high school and successfully made a hammer. In July, I did a mechanical internship at Laizhou Hongyuan Bench Vise Manufacturing Co., Ltd. and learned about the series of processes of metal from raw materials, forging, casting, heat treatment, etc.",
    "october2011": "October 2011",
    "highSchoolSport": "I participated in the school sports meeting and made a contribution to increasing team cohesion.",
    "june2012": "June 2012",
    "GaoKaoInUni": "I took the college entrance examination (GaoKao) and was successfully admitted to South China University of Technology, the only 985 and 211 university in Guangzhou that focuses on science and engineering, with a score of 646 (out of a total of 750).",
    "scutTitle": "South China University of Technology (August 2012 - June 2013)",
    "august2012": "August 2012",
    "scutEntrance": "Enrolled in the Process Equipment and Control Engineering program at the School of Mechanical Engineering, South China University of Technology. Participated in military training and met new classmates, marking the beginning of my university life.",
    "october2012": "October 2012",
    "scutGermanClass": "Enrolled in a language class during my spare time and started learning German to prepare for future studies in Germany.",
    "february2013": "February 2013",
    "scutExam": "Took the final exams of the first semester and achieved excellent results with an average score of 91, ranking at the top of the class.",
    "june2013": "June 2013",
    "scutTestAS": "During the second semester, I went to Beijing to take the TestAS exam, a competency test specifically designed for international students by the German education authorities. My final score was within the top 5%. Additionally, I passed the first-semester grade certification and APS certification, preparing to embark on my study journey in Germany.",
    "kitTitle": "Karlsruhe Institute of Technology (September 2013 - June 2023)",
    "september2013": "September 2013",
    "kitLanguageClass": "Arrived in Germany and enrolled in the university language course.",
    "february2014": "February 2014",
    "kitDSH2": "Successfully obtained the DSH2 certificate and prepared to start the bachelor's program in Mechanical Engineering at KIT.",
    "september2014": "September 2014",
    "kitBachelorStart": "Enrolled in the bachelor's program in Mechanical Engineering at Karlsruhe Institute of Technology, selected courses, and met new classmates. The elective focus was mechatronics.",
    "june2016": "June 2016",
    "kitVacuumCar": "Completed an internship in mechanical design during the bachelor's program, where I worked with classmates to design a vacuum car using 3D modeling software and manual drafting.",
    "aprilToOctober2017": "April to October 2017",
    "kitSchaefflerInternship": "Completed a six-month mandatory internship at Schaeffler during the bachelor's program. The main tasks included using MATLAB for simulation and analysis of damping in automotive engine crankshafts and camshafts, followed by presenting the findings.",
    "aprilToSeptember2018": "April to September 2018",
    "kitBachelorThesis": "Wrote the bachelor's thesis on the application of digital twins in predicting the service life of screw drive components in feed axes. Achieved grades of 2.0 or better in advanced mathematics, mechanics, and other subjects, graduating with an average grade of 2.3 (out of 1.0).",
    "april2019ToFebruary2021": "April 2019 to February 2021",
    "kitMasterThesis": "Enrolled in the master's program in Mechanical Engineering at Karlsruhe Institute of Technology, with elective focuses on automation technology and vibration studies. Achieved excellent grades of 1.0 or 1.3 in courses such as technical oscillations, mathematical methods of oscillations, and control technology. Subsequently, wrote the master's thesis on the study of vibration suppression by adding high-frequency vibration modules to multi-degree-of-freedom systems.",
    "november2021ToJune2022": "November 2021 to June 2022",
    "kitStabilusInternship": "Completed a voluntary internship during the master's program at the R&D department of Stabilus in Koblenz. Worked on noise suppression for railway tracks or wheels to advance the company's \"Silent Railway\" project. Used MATLAB and Simulink for simulation modeling, researched various noise suppression algorithms, and generated feasibility reports.",
    "june2022": "June 2022",
    "kitGraduation": "Graduated with a master's degree in Mechanical Engineering from Karlsruhe Institute of Technology, with a final average grade of 2.0.",
    "BachelorArbeit": "Undergraduate thesis (April 2018 - September 2018)",
    "BA_1": "I wrote my bachelor's thesis at the Institute of Production Engineering (wbk) of the Karlsruhe Institute of Technology on the topic of \"Design of a digital twin for the lifetime monitoring of linear feed axes.\"",
    "BA_2": "In order to establish a model for predicting the remaining service life of the axial feed shaft (the part studied in the paper is a ball screw), the necessary mathematical model was first derived and built in MATLAB. The left side of the figure below shows an actual example of a ball screw used in a 3D printer. From this, a model can be established and made part of the digital twin model of the feed shaft. (See the legend on the right side of the figure below)",
    "BA_3": "The established model can predict the remaining service life of the feed axis in real time, simplifying the complexity of part service life monitoring and making data available at any time. In subsequent research, as long as the interface is built and the correct algorithm is provided to connect to the Internet of Things (IoT), a complete digital twin model can be generated and applied to actual production.",
    "MasterArbeit": "Graduate Thesis (September 2020 - July 2021)",
    "MA_1": "My master's thesis was written at the Chair of Dynamics at the Institute of Engineering Mechanics of the Karlsruhe Institute of Technology and was entitled \"Parametric investigation of the suppression of friction-induced vibrations by high-frequency excitation\".",
    "MA_2": "The paper introduces the characteristics of single-degree-of-freedom systems and dual-degree-of-freedom systems, and solves the problem of vibration suppression of dual-degree-of-freedom systems by parameter research and reference to single-degree-of-freedom systems. There are many studies on the vibration caused by dry friction in single-degree-of-freedom systems, but the research on dual-degree-of-freedom systems is insufficient. The paper mainly attempts to use high-frequency excitation to study its effect on vibration suppression of dual-degree-of-freedom systems, and also explores the impact of high-frequency excitation on the stability of the system.",
    "MA_3": "The paper uses advanced mathematics and linear algebra methods to analyze the effects of high-frequency external excitations with different mass, damping, and frequency parameters on the vibration reduction effect of a two-degree-of-freedom system, and concludes that the friction-induced vibration of a two-degree-of-freedom system can be effectively suppressed by using high-frequency excitations, and the stability diagram of the slow motion average equation under different excitation states can be used to evaluate the stability behavior of the system. In order to explore the effectiveness of the approximate method, the possible relationship between the external excitation frequency and the corresponding eigenvalue was found."
  },
  "de": {
    "academicTitle": "Akademische Leistungen - Haichuan Yus persönliche Website",
    "qingdaoHighSchool": "Qingdao Nr. 2 Oberschule (September 2009 - Juni 2012)",
    "september2009": "September 2009",
    "qingdaoEntrance": "Bei der Aufnahmeprüfung für die Oberschule im Jahr 2009 erzielte ich 602 Punkte (von insgesamt 650 Punkte) und wurde von der Chaoyin Mittelschule in die Qingdao Nr. 2 Oberschule aufgenommen. Ich wurde in der Klasse 5 zugeteilt und begann mein Leben an der Oberschule.",
    "september2010": "September 2010",
    "scienceChoice": "Ich habe mich für das naturwissenschaftliche Hauptfach entschieden.",
    "june2011": "Juni 2011",
    "highSchoolIntern": "Ich habe während der Oberschule ein kurzes Praktikum im Metallbau absolviert und erfolgreich einen Hammer gebaut. Im Juli absolvierte ich ein Maschinenbaupraktikum bei Laizhou Hongyuan Vise Manufacturing Co., Ltd., wo ich eine Reihe von Prozessen der Metallproduktion kennenlernte, darunter Rohstoffe, Schmieden, Gießen, Wärmebehandlung usw.",
    "october2011": "Oktober 2011",
    "highSchoolSport": "Ich nahm am Schulsporttreffen teil und trug so zur Stärkung des Teamzusammenhalts bei.",
    "june2012": "Juni 2012",
    "GaoKaoInUni": "Ich legte die Kollege-Aufnahmeprüfung (GaoKao, oder Abitur auf Deutsch) ab und wurde mit einer Punktzahl von 646 (von insgesamt 750) erfolgreich an der South China University of Technology aufgenommen, der einzigen 985 und 211 Universität in Guangzhou, die sich auf Naturwissenschaften und Ingenieurwesen konzentriert.",
    "scutTitle": "South China University of Technology (August 2012 - Juni 2013)",
    "august2012": "August 2012",
    "scutEntrance": "Immatrikulierte mich im Studiengang Prozessausrüstung und Steuerungstechnik an der Fakultät für Maschinenbau der South China University of Technology. Nahm am Militärtraining teil und lernte neue Kommilitonen kennen, was den Beginn meines Universitätslebens markierte.",
    "october2012": "Oktober 2012",
    "scutGermanClass": "Melde mich in meiner Freizeit für einen Sprachkurs an und begann Deutsch zu lernen, um mich auf ein zukünftiges Studium in Deutschland vorzubereiten.",
    "february2013": "Februar 2013",
    "scutExam": "Legte die Abschlussprüfungen des ersten Semesters ab und erzielte ausgezeichnete Ergebnisse mit einem Durchschnitt von 91 Punkten, was mich in die Spitzengruppe der Klasse brachte.",
    "june2013": "Juni 2013",
    "scutTestAS": "Während des zweiten Semesters reiste ich nach Beijing, um die TestAS-Prüfung abzulegen, einen Eignungstest, der speziell für internationale Studierende von den deutschen Bildungsbehörden entwickelt wurde. Mein Endergebnis lag in den besten 5%. Zusätzlich bestand ich die Zertifizierung der Noten des ersten Semesters und die APS-Zertifizierung, um mich auf mein Studium in Deutschland vorzubereiten.",
    "kitTitle": "Karlsruher Institut für Technologie (September 2013 - Juni 2023)",
    "september2013": "September 2013",
    "kitLanguageClass": "Kam in Deutschland an und meldete mich für den Universitäts-Sprachkurs an.",
    "february2014": "Februar 2014",
    "kitDSH2": "Erfolgreich das DSH2-Zertifikat erworben und mich auf den Bachelor-Studiengang Maschinenbau am KIT vorbereitet.",
    "september2014": "September 2014",
    "kitBachelorStart": "Immatrikulierte mich im Bachelor-Studiengang Maschinenbau am Karlsruher Institut für Technologie, wählte Kurse aus und lernte neue Kommilitonen kennen. Der Schwerpunkt lag auf Mechatronik.",
    "june2016": "Juni 2016",
    "kitVacuumCar": "Absolvierte ein Praktikum in Maschinendesign während des Bachelor-Studiums, bei dem ich mit Kommilitonen einen Staubsaugerwagen entwarf, 3D-Modellierungssoftware nutzte und manuelle Zeichnungen anfertigte.",
    "aprilToOctober2017": "April bis Oktober 2017",
    "kitSchaefflerInternship": "Absolvierte ein sechsmonatiges Pflichtpraktikum bei Schaeffler während des Bachelor-Studiums. Die Hauptaufgaben umfassten die Verwendung von MATLAB zur Simulation und Analyse der Dämpfung von Kurbelwellen und Nockenwellen in Automobilmotoren sowie die Präsentation der Ergebnisse.",
    "aprilToSeptember2018": "April bis September 2018",
    "kitBachelorThesis": "Schrieb die Bachelorarbeit über die Anwendung digitaler Zwillinge zur Vorhersage der Lebensdauer von Schraubantriebskomponenten in Vorschubachsen. Erzielte Noten von 2,0 oder besser in höherer Mathematik, Mechanik und anderen Fächern und schloss mit einem Durchschnitt von 2,3 (von 1,0) ab.",
    "april2019ToFebruary2021": "April 2019 bis Februar 2021",
    "kitMasterThesis": "Immatrikulierte mich im Master-Studiengang Maschinenbau am Karlsruher Institut für Technologie mit den Schwerpunkten Automatisierungstechnik und Schwingungslehre. Erzielte ausgezeichnete Noten von 1,0 oder 1,3 in Kursen wie technische Schwingungen, mathematische Methoden der Schwingungen und Regelungstechnik. Anschließend schrieb ich die Masterarbeit über die Untersuchung der Schwingungsunterdrückung durch Hinzufügen von Hochfrequenz-Schwingungsmodulen zu Mehrkörpersystemen.",
    "november2021ToJune2022": "November 2021 bis Juni 2022",
    "kitStabilusInternship": "Absolvierte ein freiwilliges Praktikum während des Master-Studiums in der Forschungs- und Entwicklungsabteilung von Stabilus in Koblenz. Arbeitete an der Geräuschunterdrückung für Schienen oder Räder, um das \"Silent Railway\"-Projekt des Unternehmens voranzutreiben. Nutzte MATLAB und Simulink für Simulationsmodelle, erforschte verschiedene Algorithmen zur Geräuschunterdrückung und erstellte Machbarkeitsberichte.",
    "june2022": "Juni 2022",
    "kitGraduation": "Abschluss des Master-Studiums in Maschinenbau am Karlsruher Institut für Technologie mit einem Durchschnitt von 2,0.",
    "BachelorArbeit": "Bachelorarbeit (April 2018 - September 2018)",
    "BA_1": "Meine Bachelorarbeit habe ich am Institut für Produktionstechnik (wbk) des Karlsruher Instituts für Technologie zum Thema „Konzipierung eines Digitalen Zwillings für die Lebensdauerüberwachung von linearen Vorschubachsen“ verfasst.",
    "BA_2": "Um ein Modell zur Vorhersage der verbleibenden Lebensdauer der axialen Vorschubwelle (das im Artikel untersuchte Teil ist die Kugelumlaufspindel) zu erstellen, wurde zunächst das erforderliche mathematische Modell abgeleitet und dann in MATLAB erstellt. Die linke Seite des Bildes unten zeigt ein aktuelles Beispiel einer Kugelumlaufspindel, die in einem 3D-Drucker verwendet wird. Daraus kann ein Modell erstellt werden, das Teil des digitalen Zwillings der Vorschubachse wird. (Siehe Abbildung auf der rechten Seite des Bildes unten)",
    "BA_3": "Das etablierte Modell kann die verbleibende Lebensdauer der Vorschubachse in Echtzeit vorhersagen. Dies vereinfacht die komplexe Überwachung der Teilelebensdauer und stellt Daten jederzeit zur Verfügung. In nachfolgenden Forschungsarbeiten kann, sofern die Schnittstelle erstellt und der richtige Algorithmus für die Verbindung mit dem Internet der Dinge (IoT) bereitgestellt wird, ein vollständiges digitales Zwillingsmodell generiert und in der realen Produktion angewendet werden.",
    "MasterArbeit": "Masterarbeit (September 2020 - Juli 2021)",
    "MA_1": "Meine Masterarbeit wurde am Lehrstuhl für Dynamik, Institut für Technische Mechanik, Karlsruher Institut für Technologie, mit dem Titel „Parameterstudie zur Unterdrückung reibungserregter Schwingungen mithilfe hochfrequenter Anregung\n“ angefertigt.",
    "MA_2": "Das Papier stellt die Eigenschaften von Systemen mit einem Freiheitsgrad und Systemen mit zwei Freiheitsgraden vor und löst das Problem der Schwingungsunterdrückung in Systemen mit zwei Freiheitsgraden durch Parameterforschung und Bezugnahme auf Systeme mit einem Freiheitsgrad. Es gibt zahlreiche Studien zu Vibrationen, die durch Trockenreibung in Systemen mit einem Freiheitsgrad verursacht werden, die Forschung zu Systemen mit zwei Freiheitsgraden ist jedoch unzureichend. In diesem Artikel wird hauptsächlich versucht, die Wirkung hochfrequenter Anregungen auf die Schwingungsunterdrückung von Systemen mit zwei Freiheitsgraden zu untersuchen. Darüber hinaus wird auch der Einfluss hochfrequenter Anregungen auf die Stabilität des Systems untersucht.",
    "MA_3": "In der Arbeit werden Methoden der höheren Mathematik und der linearen Algebra verwendet, um die Auswirkungen hochfrequenter externer Anregungen mit unterschiedlichen Parametern wie Masse, Dämpfung und Frequenz auf die Schwingungsdämpfungswirkung des Systems mit zwei Freiheitsgraden zu analysieren. Das Dokument kommt zu dem Schluss, dass sich durch die Verwendung hochfrequenter Anregungen die durch Reibung verursachte Schwingung des Systems mit zwei Freiheitsgraden wirksam unterdrücken lässt. Zudem kann das Stabilitätsdiagramm der Gleichung für den Zeitlupendurchschnitt unter unterschiedlichen Anregungszuständen zur Bewertung des Stabilitätsverhaltens des Systems verwendet werden. Um die Gültigkeit des Näherungsverfahrens zu untersuchen, wurden mögliche Zusammenhänge zwischen den äußeren Anregungsfrequenzen und den entsprechenden Eigenwerten ermittelt."
  },
  "zh": {
    "academicTitle": "学术成果 - 余海川的个人网站",
    "qingdaoHighSchool": "山东省青岛第二中学 (2009年9月 - 2012年6月)",
    "september2009": "2009年9月",
    "qingdaoEntrance": "在2009年的中考中，我以优异的成绩从超银中学考入青岛二中，开始了高中阶段的学习生活。",
    "september2010": "2010年9月",
    "scienceChoice": "文理分科，选择了理科方向。",
    "june2011": "2011年6月",
    "highSchoolIntern": "进行了高中阶段的短暂的金工实习，成功制成了一把榔头。之后的7月份在莱州鸿源台钳制造有限公司进行了机械实习，了解了金属从原材料，锻造，铸造，热处理等等一系列的流程。",
    "october2011": "2011年10月",
    "highSchoolSport": "参加学校运动会，为增加团队凝聚力做出一份贡献。",
    "june2012": "2012年6月",
    "GaoKaoInUni": "参加高考，以优异的成绩顺利考入了广州唯一一所理工科为主的985，211大学华南理工大学。",
    "scutTitle": "华南理工大学 (2012年8月 - 2013年6月)",
    "august2012": "2012年8月",
    "scutEntrance": "入学华南理工大学机械学院过程装备与控制工程专业，进行军训并认识新同学们，开始了大学生活。",
    "october2012": "2012年10月",
    "scutGermanClass": "课余时间报名语言班，开始学习德语，为未来的德国留学做准备。",
    "february2013": "2013年2月",
    "scutExam": "参加第一学期期末考试，成绩优异，平均分数91分，名列班级前茅。",
    "june2013": "2013年6月",
    "scutTestAS": "第二学期期间前往北京，参加了TestAS考试，即德国教育部门专门为外国留学生准备的能力测试，最终成绩在前5%之内。此外还通过了大学第一学期的成绩认证以及APS认证，即将开启德国留学之旅。",
    "kitTitle": "卡尔斯鲁厄理工学院 (2013年9月 - 2023年6月)",
    "september2013": "2013年9月",
    "kitLanguageClass": "初到德国，报名入学大学语言班。",
    "february2014": "2014年2月",
    "kitDSH2": "顺利考取DSH2证书，准备入读KIT机械制造本科。",
    "september2014": "2014年9月",
    "kitBachelorStart": "入学卡尔斯鲁厄理工学院机械制造专业本科，选课，认识新同学。本科的选修方向为机电一体化。",
    "june2016": "2016年6月",
    "kitVacuumCar": "本科机械设计专业课校内实习，与同学组队设计吸尘车，依靠3D建模软件建模并手工设计绘制吸尘车图纸。",
    "aprilToOctober2017": "2017年4月至10月",
    "kitSchaefflerInternship": "在舍弗勒公司进行为期半年本科阶段的义务实习。主要内容为利用MATLAB对于汽车发动机曲轴和凸轮轴在减震方面的仿真与分析，并将结论进行展示。",
    "aprilToSeptember2018": "2018年4月至9月",
    "kitBachelorThesis": "撰写本科毕业论文，题目为研究数字孪生在预测进给轴的螺杆传动零件使用寿命方面的应用。本科阶段在高数，力学等学科取得了2,0及更好的成绩，最后以平均分2,3的绩点(满分1,0)本科毕业。",
    "april2019ToFebruary2021": "2019年4月至2021年2月",
    "kitMasterThesis": "入学卡尔斯鲁厄理工学院机械制造专业研究生，选取两个选修方向为自动化技术以及振动学，并且在技术振荡学，振荡学的数学方法，控制技术等课程中分别取得了1.0或者1.3的优秀成绩。随后撰写研究生毕业论文，题目为通过对于多自由度物体添加高频率振动模块从而达到抑制振动效果的研究。",
    "november2021ToJune2022": "2021年11月至2022年6月",
    "kitStabilusInternship": "在科布伦茨的斯泰必鲁斯公司的研发部门进行研究生阶段的自由实习。工作内容为研究铁路轨道或者车轮的噪声抑制，从而帮助公司的\"Silent Railway\"项目向前推进。工作中运用到了MATLAB和Simulink仿真模拟建模，来进行多种噪声抑制算法的研究和Simulink仿真分析，最终生成了可行性报告。",
    "june2022": "2022年6月",
    "kitGraduation": "卡尔斯鲁厄机械制造研究生毕业,平均成绩最终为2,0分。",
    "BachelorArbeit": "本科毕业论文 (2018年4月 - 2018年9月)",
    "BA_1": "我的本科毕业论文是在卡尔斯鲁厄理工学院的生产工程研究所(wbk, Institut für Produktionstechnik)完成的，题目是《用于线性进给轴寿命监控的数字孪生设计》。",
    "BA_2": "为了能够建立预测轴向进给轴(论文中研究的零件为滚珠丝杠)的剩余使用寿命的模型，首先推导出了必须的数学模型，并在MATLAB建模。下图左侧为一个在3D打印机中运用的滚珠丝杠的实际案例。由此可以建立模型并使之成为进给轴数字孪生模型的一部分。(见下图右侧图例)",
    "BA_3": "建立起的模型可以实时预测进给轴的剩余使用寿命，简化了零件使用寿命监测的复杂性，并使数据随时可用，并且在后续研究中，只要搭建接口并提供正确算法，连接物联网 (IoT)，即可生成一个完整的数字孪生模型，运用到实际生产中。",
    "MasterArbeit": "研究生毕业论文 (2020年9月 - 2021年7月)",
    "MA_1": "我的研究生毕业论文是在卡尔斯鲁厄理工学院的工程力学研究所动力学部门完成的，题目是《利用高频激励抑制摩擦引起的振动的参数研究》。",
    "MA_2": "论文介绍了单自由度系统和双自由度系统的特性，以及通过参数研究并参照单自由度系统，来解决双自由度系统振动抑制的问题。目前有很多对于单自由度系统由干性摩擦引起的振动的研究，但是双自由度系统的研究却有不足。论文主要尝试利用高频激励来研究其对于双自由度系统振动抑制的效果，同时也探究了高频激励对于系统的稳定性的影响。",
    "MA_3": "论文利用高等数学及线性代数方法，分析了有不同的质量，阻尼以及频率等参数的高频外部激励对于双自由度系统减振效果的影响，并且得出结论: 采用高频激励可以有效抑制两自由度系统的摩擦诱发振动，可以使用不同激励状态下的慢运动平均方程的稳定性图来评估系统的稳定性行为。为了探讨近似方法的有效性，找到了外部激励频率和相应特征值之间的可能关系。"
  }
}