{
  "en": {
    "about": "About",
    "aboutDescription": "I am Haichuan Yu, a mechanical engineer from Qingdao, China, passionate about technology and innovation. Currently residing in Böblingen, Germany, I work at Bertrandt AG, primarily involved in the development and testing of automotive electronic control units and the R&D of prototype vehicles for OEMs. I love technological innovation and enjoy solving practical problems through programming and data analysis.\n\nBelow is my personal education, life, and work experience:",
    "aboutTotal": "About Me - Overview",
    "boeblingen": "Böblingen",
    "boeblingenFlugfeld": "old airfield area of Böblingen",
    "boeblingenMercaden": "Böblingen Mercaden shopping mall",
    "boeblingenMotorWorld": "the motor world of Böblingen",
    "boeblingenWeihnachtsmarkt": "Böblingen Christmas Market",
    "boeblingenDescription": "Böblingen, a satellite city of Stuttgart, is a charming little town with winding streets. Just north of the city, in Sindelfingen, is home to Mercedes-Benz's largest factory.",


    "company_Hongyuan": "Laizhou Hongyuan Vise Manufacturing Co., Ltd.",
    "company_Hongyuan_position": "Metalworking Intern",
    "company_Hongyuan_time": "June 2011 - July 2011",
    "company_Hongyuan_work": "In the summer of 2011, I completed a one-month internship at Laizhou Hongyuan Vise Manufacturing Co., Ltd.",
    "company_Hongyuan_work_detailed": "Laizhou Hongyuan Vise Manufacturing Co., Ltd. has over 50 years of history in vise production and is a leader in China's vise manufacturing industry. The company mainly produces vises, austempered ductile iron (ADI), automotive parts, engineering machinery parts, and power equipment parts, exporting to the United States, Canada, Australia, Japan, and EU countries.\n\nIn the summer of 2011, I completed a one-month internship at Laizhou Hongyuan Vise Manufacturing Co., Ltd. I learned about the various processes in the factory, from primary processing of metal raw materials to casting, forging, and heat treatment. Participating in production practices gave me a deeper understanding of mechanical manufacturing and laid a solid foundation for my studies in mechanical engineering at university.",

    "company_Lolin": "Qingdao Lolin Machinery Co., Ltd. ",
    "company_Lolin_position": "Representative in Germany",
    "company_Lolin_time": "July 2012 - Present",
    "company_Lolin_work": "Since graduating from high school in 2012, I have worked at Qingdao Lolin Machinery Co., Ltd., serving as an intern, deputy manager, and European market development specialist.",
    "company_Lolin_work_detailed": "Founded in 1990 and headquartered in Qingdao, Qingdao Lolin Machinery Co., Ltd. has a global presence. We export over 400 containers annually to OEMs and tier-one, tier-two, and tier-three suppliers in Europe, Japan, and the USA. We supply forged and cast machine parts for agricultural machinery, construction equipment, railway systems, and heavy-duty trucks.\n\nSince graduating from high school in 2012, I have been working at Qingdao Lolin Machinery Co., Ltd. as an intern, deputy manager, and specialist for European market development. On behalf of the company, I actively develop new customers and maintain existing ones in Germany and participate in international mechanical engineering trade fairs in Hanover, Düsseldorf, and Stuttgart.\n\nIn 2018, I represented the company with the manager at the Hannover Industrial Fair, maintaining relationships with existing clients and exploring new potential customers.\n\nIn 2019, I independently represented the company at the METEC metallurgy and casting exhibition in Düsseldorf. From setting up the booth to arranging exhibits and brochures, coordinating event logistics, and engaging with clients, I handled everything. This exhibition not only enriched my experience but also helped the company secure multiple new clients.",

    "company_Schaeffler": "Schaeffler AG",
    "company_Schaeffler_position": "Intern",
    "company_Schaeffler_time": "May 2017 - November 2017",
    "company_Schaeffler_work": "In May 2017, I began a six-month internship at Schaeffler AG as part of my undergraduate studies. ",
    "company_Schaeffler_work_detailed": "Schaeffler AG is a technology company focused on drive systems, operating in the automotive and industrial sectors. With annual revenue of approximately €13 billion (2016) and over 85,000 employees worldwide, its headquarters is located in Herzogenaurach, Bavaria, Germany.\n\nIn May 2017, I began a six-month internship at Schaeffler AG as part of my undergraduate studies. I worked in the chain drive development department, with the goal of understanding the principles of chain drive vibration and exploring the damping effects of absorbers on camshafts and crankshafts in automotive engines.\n\nThe research focused on the crankshafts and camshafts of engines from three different car brands. Due to their varying drive principles and installation positions, a comprehensive analysis of the absorber's working principles and effects was possible.\n\nThe dual-mass flywheel can effectively reduce torsional vibrations caused by engine rotation imbalances. It reduces the impact during clutch engagement or disengagement and minimizes engine vibrations. My internship goal was to study the installation of absorbers (Tilgers) on dual-mass flywheels and analyze their effectiveness in reducing chain drive system vibrations using MATLAB and simulation software.\n\nThe project involved order analysis of rotating bodies at different frequencies, Fourier analysis to decompose the motion of rotating objects into fixed-frequency components, and the use of Schaeffler's internal simulation software, DyFaSim, to analyze the damping effects of absorbers on various automotive engines.\n\nThe research results were presented in a PowerPoint presentation. The study showed that lower orders are the main cause of vibrations, and absorbers with specific damping and resonance frequencies can effectively reduce vibrations. Dual-mass flywheels with absorbers performed better in suppressing engine vibrations compared to those without.",

    "company_Stabilus": "Stabilus SE",
    "company_Stabilus_position": "Intern",
    "company_Stabilus_time": "November 2021 - July 2022",
    "company_Stabilus_work": "In November 2021, I began an eight-month voluntary internship at Stabilus SE during my graduate studies.",
    "company_Stabilus_work_detailed": "Stabilus SE is a leading manufacturer of hydropneumatic adjustment elements, hydraulic dampers, electromechanical drives, and door adjusters for automotive and industrial applications. With over 6,000 employees and 16 production sites worldwide, its headquarters is located in Koblenz, Germany.\n\nIn November 2021, I began an eight-month voluntary internship at Stabilus SE during my graduate studies. I worked in the company's R&D Innovation Department (SDI-Entwicklung Innovation), focusing on the \"Silent Railway\" project, which aims to reduce noise and vibrations in railway tracks and their contact systems.\n\nThe \"Silent Railway\" project was inspired by active noise-canceling headphones. By treating the railway system as a whole, the project aims to apply active noise cancellation (ANC) technology to reduce vibrations and noise, improving the quality of life for nearby residents. The challenge lies in the fact that ANC is typically used in closed or small areas, and its application to open railway systems requires further research.\n\nAfter starting the project, I reviewed extensive literature, including railway system standards, noise and vibration technical documents, and ANC-related articles. I then used MATLAB and Simulink to build simulation models, embedding various ANC algorithms and comparing their performance. We also collaborated with ESI to use their SimulationX multi-body simulation software to test the noise and vibration reduction effects of different algorithms.\n\nThe feasibility report indicates that the ANC concept can be applied to railway simulation models with certain effects, and the addition of a PID controller can further improve performance.\n\nThe research results were presented in a PowerPoint presentation, and a feasibility report was generated. The study analyzed the effects of various ANC algorithms in railway systems and concluded that suitable actuators are needed to generate the required counter-vibrations. Due to limitations, no physical tests were conducted on actual railway tracks, and only simulation results were obtained.",

    "company_Bertrandt": "Bertrandt AG",
    "company_Bertrandt_position": "Automotive ECU Safety Test R&D Engineer",
    "company_Bertrandt_time": "July 2022 until now",
    "company_Bertrandt_work": "After graduating with a master's degree in Mechanical Engineering from the Karlsruhe Institute of Technology, I joined Bertrandt AG in Ehningen in July 2022 as a development engineer.",
    "company_Bertrandt_work_detailed": "Bertrandt AG is a publicly traded company providing engineering services in mechanical engineering. With around 14,000 employees at over 50 locations, primarily in Europe but also in the US and China, it serves clients in the automotive and aviation industries.\n\nAfter graduating with a master's degree in Mechanical Engineering from the Karlsruhe Institute of Technology, I joined Bertrandt AG in Ehningen in July 2022 as a development engineer.\n\nAt Bertrandt AG, I worked in the \"CarIT Security Testhouse\" project team. The main task was to develop and test the security-related functions of electronic control units (ECUs) for Mercedes-Benz. This involved using CANoe to generate test reports, analyze errors, and track issues.\n\nEvery week, a varying number of ECUs were delivered to our team for testing. Upon receipt, the ECUs were registered using Jira and Confluence for version management. The software and hardware versions of the ECUs were then read, and if they did not match the expected versions, the ECUs were connected to a computer and reprogrammed using DTS Monaco to ensure the correct test versions.\n\nIt is important to note that different ECUs use different bus communication systems, such as CAN, Flexray, or Ethernet. For CAN and Flexray, there are High and Low lines for communication, while Ethernet has a Wakeup Line. Therefore, proper bus identification is crucial during ECU connection.\n\nAfter the ECUs were correctly connected and programmed, the appropriate test environment was configured in CANoe. Different ECUs and bus systems require different test environments. Once configured, a quick check was performed to ensure the ECUs responded to the test environment's queries. If not, the setup was rechecked.\n\nThe ECUs were then subjected to a debugging phase, which included about 20 test cases lasting between 5 to 30 minutes. If no critical errors were found in the debug report, a full test of 200 to 500 test cases was conducted, lasting 5 to 10 hours.\n\nThe test cases focused on the security performance of the ECUs. Mercedes-Benz developed the ZenZefi system, a central certificate management system (Zentrale Zertifikatsverwaltung). Each ECU is pre-installed with certificates, including Root, Backend, Intermediate, and ECU certificates. A complete certificate chain is required for security testing.\n\nThe main test items included secure variant coding, secure programming, and secure onboard communication. Additionally, tests such as TLS (Transport Layer Security) and Gateway Tests were conducted.\n\nAfter the test reports were generated, we analyzed the errors and uploaded the reports to Mercedes-Benz's STARC error tracking system. We then discussed the error causes with the development team and implemented improvements.",

    "company_Mercedes": "Mercedes-Benz AG",
    "company_Mercedes_position": "Automobile engineer for E/E static commissioning",
    "company_Mercedes_time": "April 2024 - May 2025",
    "company_Mercedes_work": "After the \"CarIT Security Testhouse\" project at Bertrandt, I was assigned to Mercedes-Benz in Sindelfingen, working in the Quality Management Department's ramp-up factory (Anlauffabrik) as a E/E static commissioning engineer.",
    "company_Mercedes_work_detailed": "Mercedes-Benz is a German automotive brand known for luxury and high performance. Headquartered in Stuttgart, Germany, it produces a range of passenger vehicles and commercial vehicles. Founded in 1886, the company has annual revenue exceeding €150 billion and over 170,000 employees worldwide.\n\nAfter the \"CarIT Security Testhouse\" project at Bertrandt, I was assigned to Mercedes-Benz in Sindelfingen, working in the Quality Management Department's ramp-up factory (Anlauffabrik) as a E/E static commissioning engineer. My role involved assisting in the development of prototype vehicles and analyzing issues with electronic control units (ECUs) during testing.\n\nI was responsible for the 223M series at Mercedes-Benz, which includes the S-Class and Maybach S-Class sedans. For each vehicle series, the development stages are divided into E, A, and B phases. The E phase is the development stage, while A and B are pre-production debugging stages, followed by Pro1 and Pro2 production phases. Vehicles at each stage are sent to the ramp-up factory to test the latest software versions. After completing static debugging, dynamic debugging, and extended function testing, the vehicles are sent to the R&D department for further testing.\n\nIn Static Commissioning we use the IS-Tester, a portable testing device designed for automated testing. After connecting to the vehicle's OBD interface, the IS-Tester performs various tests. The test reports are uploaded to Mercedes-Benz's servers for analysis and download. The test scripts are written in NiSP (Neue Intelligente Schnittstelle Programm), a C-based language. If errors requiring further analysis are found in the test reports, the scripts are reviewed line by line, and the R&D team is consulted for resolution.\n\nWhile analyzing and resolving errors in the test reports, I also used Python scripts to analyze error patterns and processing times across different development stages. This helped optimize the process and improve the efficiency of static debugging and other steps.",

    "companyB": "Company B",
    "companyC": "Company C",
    "companyD": "Company D",
    "contact": "Contact",
    "guangzhou": "Guangzhou",
    "guangzhouDescription": "Guangzhou is a major city in southern China, the heart of the Pearl River Delta, known as the 'Gateway to South China'. In 2012, I enrolled in the School of Mechanical Engineering at South China University of Technology, majoring in Process Equipment and Control Engineering.",
    "guangzhouMeishi": "Guangzhou delicious cuisine",
    "guangzhouSCUT": "South China University of Technology",
    "guangzhouBeijingRoad": "Street scene of Beijing Road in Guangzhou",
    "SunYatSenHall": "Sun Yat-sen Memorial Hall",
    "home": "Home",
    "karlsruhe": "Karlsruhe",
    "karlsruheDescription": "Karlsruhe is a city in Germany known for its fan-shaped urban structure and the Federal Court of Justice. From 2014 to 2021, I studied mechanical engineering at the Karlsruhe Institute of Technology, where I received both a bachelor's and a master's degree.",
    "karlsruheMarketSquare": "Market Square of Karlsruhe",
    "karlsruheVonOben": "View of Karlsruhe from above",
    "karlsruheZKM": "ZKM Media Center" ,
    "kit": "Karlsruhe Institute of Technology",
    "kitDescription": "Karlsruhe Institute of Technology is a top technical university in Germany, known for research and innovation.",

    "otherCitiesTitle": "Other german cities",
    "othercities": "Other german cities",
    "othercitiesDescription": "Karlsruhe and Böblingen are the two German cities where I spent the most time. Besides these, I've also visited many other German cities for work, vacations, and to see friends, each with its own unique charm.",

    "hamburg": "Hamburg",
    "hamburgDesc": "Hamburg is a well-known port city in northern Germany with almost 1.89 million inhabitants, making it the second largest city in Germany after Berlin. During our visit, we toured Hamburg's famous harbor, the fish market, and Miniatur Wunderland, and enjoyed a feast of lobster.",
    "duesseldorf": "Düsseldorf",
    "duesseldorfDesc": "The Düsseldorf Metallurgical Exhibition is the largest metallurgical exhibition in Europe. In 2019, I was fortunate enough to participate, which not only allowed me to experience the charm of this international metropolis, but also to enjoy a feast at a Michelin-recommended high-end restaurant in the city center.",
    "koeln": "Köln",
    "koelnDesc": "Cologne is the fourth largest city in Germany and the largest city in North Rhine-Westphalia. With over 2,000 years of history, it is one of Germany's oldest cities. We have visited Cologne Cathedral many times and enjoyed the beautiful scenery along the banks of the Rhine River.",
    "bonn": "Bonn",
    "bonnDesc": "Bonn has a population of approximately 320,000, making it the 19th largest city in Germany (as of 2023). Formerly the capital of the Electorate of Cologne and West Germany, it remains an important political center in Germany. The Federal Museum of German History, located in Bonn, was founded in 1994 and focuses on showcasing the political, social, and daily life history of the Federal Republic of Germany from 1945 to the present.",
    "trier": "Trier",
    "trierDesc": "Trier, Germany's oldest city, lies on the Moselle River. Founded in 16 BC, it was an important fortress of the Roman Empire and still boasts relics such as the Black Gate and the Caesar Baths. Karl Marx was born here in 1818, and his former home is now a museum. A famous bronze statue of Marx stands in the city center, symbolizing the influence of his philosophy and revolutionary ideas.",
    "koenigswinter": "Königswinter",
    "koenigswinterDesc": "Königswinter is a city in the Cologne district. Nearby, on the Dragon Rock, stands a private villa-style castle called Drachenburg (German: Schloss Drachenburg).",
    "stuttgart": "Stuttgart",
    "stuttgartDesc": "Stuttgart is located in the Neckar Valley in the southwestern state of Baden-Württemberg, near the Black Forest. It is not only the capital of Baden-Württemberg, but also the capital of the Stuttgart district and the state's largest city. It is also the state's political center. Due to its economic, cultural, and administrative importance, it is one of Germany's most well-known cities. We visited Stuttgart's central square, Wilhelma Zoo, the famous city library, and many other attractions on several occasions.",
    "ludwigsburg": "Ludwigsburg",
    "ludwigsburgDesc": "Ludwigsburg is located about 12 kilometers north of the center of Stuttgart and has a population of about 100,000. Ludwigsburg Palace is one of the largest Baroque palace buildings in Germany. Every year, it hosts a grand pumpkin festival where people decorate pumpkins and the Baroque gardens are transformed into a world full of pumpkin art. Visitors can encounter characters and scenes made of thousands of pumpkins in a beautiful autumn atmosphere.",
    "berlin": "Berlin",
    "berlinDesc": "Berlin, the capital and largest city of Germany, is a world-renowned center for culture, politics, media, and science. We enjoyed a concert in Berlin, visited the German Bundestag, and had a close encounter with giant pandas at the Berlin Zoo.",
    "koblenz": "Koblenz",
    "koblenzDesc": "Koblenz is the third most populous city in the German state of Rhineland-Palatinate, located at the confluence of the Moselle and Rhine rivers. The confluence, known as the German Corner, is a local landmark and a symbol of German unity. I completed a six-month internship at Stabilus, a company located in Koblenz, during my graduate studies.",
    "hannover": "Hannover",
    "hannoverDesc": "Hannover is a city with a highly developed industrial manufacturing sector, serving as a center for Germany's automotive, machinery, and electronics industries, and is renowned for hosting trade fairs. I represented Qingdao Lolin Mech. at the 2017 Hannover Fair.",
    "dresden": "Dresden",
    "dresdenDesc": "Dresden is an important cultural, political, and economic center in eastern Germany. We visited famous landmarks there, including the Zwinger Palace, the Dresden Royal Palace, and the cathedral.",
    "nuernberg": "Nürnberg",
    "nuernbergDesc": "Nuremberg is the central city of the Central Franconia district in Bavaria, Germany. After World War II, the Nuremberg Trials, in which Nazi German war criminals were tried, were held here. We visited the city center and the Nuremberg Zoo.",










    "touristCitiesTitle": "Other european countries",
    "touristcities": "Other european countries",
    "touristcitiesDescription": "Besides Germany, I also traveled to several other neighboring European countries, experiencing different customs and cultures. Below, I will introduce different cities in these countries, some famous for their natural scenery, some for their cultural landscapes, and some for both.",

    "france": "France",

    "project_cadIntro": "Since my undergraduate studies, I have used various CAD software, such as SolidWorks or Creo PTC, to learn and practice CAD software modeling knowledge and projects.",

    "projectsOverview": "Project Overview",
    "projectsOverviewText": "I have participated in several projects during my studies, work and leisure time. Here you can find introductions to projects in various fields, from which I have benefited greatly.",

    "projectCAD-1": "Project CAD - 1",
    "projectCAD-1Long": "As part of a team of five students, I created a top-down assembly as a CAD model and managed it in a product data management (PDM) system. Completing the assigned design task is part of the CAD and PDM training concept integrated into the Mechanical Engineering course. The knowledge required for the task is acquired through self-study via e-learning and consolidated through practical application. The results are defended in a colloquium, thus ensuring the achievement of the learning objectives.\nIn this project, I fulfilled the following requirements, among others: explain the principle of references and apply it appropriately in the CAD model; create advanced design elements: the pull feature, the tensile blend feature, the shell feature, and datum curves; create top-down models using skeleton techniques and edit them in a team, etc.\nDurch dieses Projekt im Rahmen meines Bachelorstudiums konnte ich nicht nur Kenntnisse und Erfahrungen in Teamarbeit und Produktentwicklungsmanagement sammeln, sondern auch meine Fähigkeiten in der CAD-Modellierung verbessern. Ich beherrsche nun sowohl die grundlegenden als auch die fortgeschrittensten Funktionen von Creo PTC.\nThrough this project during my undergraduate studies, I not only gained knowledge and experience in teamwork and product creation management, but also improved my CAD software modeling skills. I am now proficient in the basic and most advanced operations in Creo PTC. This includes basic operations such as stretching and rotating, as well as converting 3D models to 2D drawings, and creating 3D models from existing 2D drawings.",
    "projectCAD-1Short": "University Mechanical Design Theory Course Project",

    "projectCAD-2": "Project CAD - 2",
    "projectCAD-2Long": "Using online tutorials, I created a 3D model of an aircraft engine from scratch using Creo PTC.\nFirst, I practiced reading and understanding CAD drawings, starting with individual parts, through several online tutorials. Then, I modeled the engine in Creo PTC. After 10 to 15 practice sessions, I began creating the 3D model of the aircraft engine. This included individual engine blades, the front section of the engine, the combustion chamber, and finally the entire engine.\nThis personal project not only familiarized me with the detailed structure of aircraft engines—the crown jewel of human industry—but also gave me practical experience in applying the intricacies of CAD modeling, laying a solid foundation for future projects.",
    "projectCAD-2Short": "Aircraft Engine Modeling",

    "projectCAD-3": "Project CAD - 3",
    "projectCAD-3Long": "Building on my previous experience with CAD software modeling, during my internship at Stabilus' \"Silent Railway\" innovation project department, I used Creo PTC to create a simple 3D model of the contact between rails and train wheels. This was to investigate methods to reduce noise generated by the contact between the wheels and rails when a train passes. The model revealed various possible vibration reduction methods, including springs, dampers, and energy absorbers mounted on the wheels and even rail sleepers.\nCAD modeling allows for a more intuitive analysis of vibration and noise reduction possibilities before actual physical testing, facilitating brainstorming and finding more suitable solutions.",
    "projectCAD-3Short": "Railway Track and Train Wheel Modeling",

    "project_vbaIntro": "I am familiar with the basic operations of Excel VBA and use it to automate and optimize workflows to improve work efficiency.",
    "projectVBA-1": "Project VBA",
    "projectVBA-1Long": "Using online tutorials, I learned and developed a database table structure management tool with VBA, providing CRUD (Create, Read, Update, Delete) operations for Access or SQL Server databases. It connects to the database via ADO (ActiveX Data Objects) and executes SQL statements for operations. Through this project, I became familiar with and proficient in using the basic operations of Excel and VBA. Later, thanks to my familiarity with VBA, I applied it to my internship and job search process. In addition, I used VBA in my work to automate workflows and improve work efficiency.",
    "projectVBA-1Short": "VBA Database Management",


    "project_matlabIntro": "I used MATLAB and Simulink software to complete my undergraduate and graduate theses. In addition, I also used MATLAB and Simulink for several research and development projects during my internships and work.",
    "projectMATLAB-1": "Project MATLAB - 1",
    "projectMATLAB-1Long": "In my undergraduate thesis, completed at the Institute for Production Engineering (WBK) at the Karlsruhe Institute of Technology, entitled \"Design of a digital twin for the lifetime monitoring of linear feed axes\"，I used MATLAB to build a model, process data, plot plots, and dynamically update it. I defined the characteristics of the ball screw, including its geometric parameters, material properties, and axial stiffness calculations. I processed measurement data and calculated the equivalent load, service life, and expected remaining service life of the bearing, and monitored the data plotting.\nTo build a model that could predict the remaining service life of an axial feed axis (the part studied in the thesis is a ball screw), the necessary mathematical model was first derived and then modeled in MATLAB. The background image shows a real-world example of a ball screw used in a 3D printer. This allows the model to be built and incorporated into the digital twin model of the feed axis. (See the legend below) The established model can predict the remaining service life of the feed axis in real time, simplifying the complexity of part service life monitoring and making the data readily available. Furthermore, in subsequent research, as long as the interface is built and the correct algorithm is provided, and the Internet of Things (IoT) is connected, a complete digital twin model can be generated and applied to actual production.",
    "projectMATLAB-1Short": "Bachelor's Thesis",

    "projectMATLAB-2": "Project MATLAB - 2",
    "projectMATLAB-2Long": "My master's thesis was completed in the Dynamics Department of the Institute of Engineering Mechanics at the Karlsruhe Institute of Technology. The title was \"A Parametric Study of Vibration Suppression Induced by Friction Using High-Frequency Excitation.\"\n\nThe thesis introduced the characteristics of single-degree-of-freedom (DOF) and two-degree-of-freedom (DFB) systems, and explored how to address vibration suppression in DFB systems by studying parameters and referencing single-DOF systems. While there is considerable research on vibrations caused by dry friction in single-DOF systems, research on DFB systems is insufficient. This thesis primarily attempts to investigate the effect of high-frequency excitation on vibration suppression in DFB systems, and also explores the impact of high-frequency excitation on system stability.\nUsing advanced mathematics and linear algebra methods, and modeling with MATLAB, the thesis analyzed the effects of high-frequency external excitation with different parameters such as mass, damping, and frequency on vibration reduction in DFB systems. The conclusion is that high-frequency excitation can effectively suppress friction-induced vibrations in two-DOF systems, and the stability behavior of the system can be evaluated using the stability plots of the slow-motion average equations under different excitation states. To explore the effectiveness of the approximation method, a possible relationship between the external excitation frequency and the corresponding eigenvalues was found.",
    "projectMATLAB-2Short": "Master's Thesis",

    "projectMATLAB-3": "Project MATLAB - 3",
    "projectMATLAB-3Long": "To investigate the generation mechanism of train and track noise and vibration and methods for suppressing noise and vibration, simulation models were built using MATLAB and Simulink. Algorithms from various ANC (Active Noise Cancellation) models were embedded, and their advantages and disadvantages were compared.\nAn LQR (Low Quality Reduction) controller for the train suspension was built using MATLAB code. By adjusting different parameters in the Simulink model, the performance of active and passive suspensions was compared, and the effectiveness in suppressing vibration and noise was analyzed. Furthermore, different active noise reduction algorithm models were built using Simulink, and their noise reduction effects were compared.",
    "projectMATLAB-3Short": "Railway Vibration and Noise Reduction Model Simulation",

    "projectMATLAB-4": "Project MATLAB - 4",
    "projectMATLAB-4Long": "During my internship at the engine R&D department of the Schaeffler Group, I used MATLAB to analyze simulation models to reduce vibration in chain drive systems. Specifically, MATLAB was used to perform order analysis on the rotational speed of a rotating body at different frequencies. Fourier analysis was used to decompose the motion of the object into several component motions of different frequencies to analyze the vibration reduction effect of camshafts and crankshafts of different car engine brands after the installation of energy absorbers (Tilgers).",
    "projectMATLAB-4Short": "Engine energy absorber vibration reduction simulation",

    "project_pythonIntro": "I use Python to write games, crawl web information, process and analyze data, and improve the enjoyment of life and the efficiency of work.",
    "projectPython-1": "Project Python - 1",
    "projectPython-1Long": "A 2D shooting game developed with Pygame, where the player controls a rabbit defending a castle from badgers by shooting arrows. The player can move the character with the WASD keys and shoot arrows with a mouse click, controlling the firing angle. Badgers, as enemies, periodically appear on the right side of the screen and move to the left to attack the castle, resulting in health loss upon contact.",
    "projectPython-1Short": "2D shooting game with Pygame",

    "projectPython-2": "Project Python - 2",
    "projectPython-2Long": "This project uses Python to create a hotel review crawler and a word cloud generator. It primarily uses Selenium to extract reviews from Booking.com and then processes the data with Pandas and generates positive/negative word clouds based on the NLTK and WordCloud libraries.\n Users can enter the hotel name and the desired number of reviews for the program to search, save the results as a CSV file, and generate word clouds to visually represent the hotel's characteristics.",
    "projectPython-2Short": "Hotel Reviews with Python Scripts",

    "projectPython-3": "Project Python - 3",
    "projectPython-3Long": "Against the backdrop of a sluggish global economy, it's essential to stay up-to-date with current events and understand the latest developments in the industry. Therefore, I use Python libraries like requests or selenium to crawl the latest news related to various industries in Germany and around the world from major portal websites; I parse news articles that match keywords, extract summaries and webpage links; and generate PDF reports to keep track of the latest developments anytime, anywhere.",
    "projectPython-3Short": "Current Industry News in Germany and Worldwide with Python Scripts",

    "projectPython-4": "Project Python - 4",
    "projectPython-4Long": "During my work on E/E static commissioning at Mercedes-Benz, a Python program was used to record the frequency of various faults in the vehicles' electronic control units during different test phases, as well as the average processing time per vehicle. The causes were analyzed, and suggestions for improvement were developed. The database contains various test processes for over one hundred test vehicles, with an average test duration of over three hours per vehicle. Finally, a feasibility report and recommendations for increasing test efficiency were prepared.",
    "projectPython-4Short": "Summary of work details and suggestions for improvement using Python",

    "project_othersIntro": "In my work and life, I have also come into contact with and used many other software programs, such as CANoe, DTS Monaco, etc.",
    "projectCANoe-1": "Project CANoe",
    "projectCANoe-1Long": "CANoe is a software development and testing tool developed by Vector Informatik. This software is mainly used by automotive manufacturers and electronic controller suppliers. It can be used for the development, analysis, simulation, testing, diagnosis, and startup of electronic controller networks or individual electronic controllers. \nWith the help of database files provided by OEMs, we can generate CANoe test environments to conduct real or simulated tests of vehicle electronic control units and develop new ECU.\nDuring my time at Bertrandt Group, I used CANoe to conduct cybersecurity tests on real ECU prototypes and generated test reports. In addition, I used CANoe to simulate nodes for certain ECUs, a process known as Restbus Simulation, to observe the status of the ECUs' sending and receiving of information.",
    "projectCANoe-1Short": "Using CANoe to perform test case-based testing of vehicle electronic control units.",

    "projectDTS-2": "Project Softing DTS.monaco",
    "projectDTS-2Long": "DTS.monaco is a standards-based tool (e.g., ODX, OTX, and UDS) that comprehensively covers all tasks from development, testing, after-sales to pre-manufacturing: diagnostics, analysis, OBD, Flash refresh, measurement, calibration, and residual bus simulation. \nWhile working at Bertrand Group, I used Monaco for ECU data reading, flashing, communication diagnostics, etc. \nAt Mercedes-Benz, during static vehicle commissioning, I used Monaco to connect to the vehicle's OBD interface to flash the ECUs and perform custom variant coding.",
    "projectDTS-2Short": "Using Softing DTS.monaco for diagnostics, analysis, and ECU flashing of vehicle electronic control units.",

    "projects": "Projects",
    "qdTaiDong": "Street scene in Taidong, Qingdao",
    "qdez": "Qingdao No.2 High School",
    "qdezDescription": "Qingdao No.2 High School is a prestigious secondary school in Qingdao, China.",
    "qdShiNan": "Street scene in Shinan District, Qingdao",
    "qingdao": "Qingdao",
    "qingdaoChaoYin": "Qingdao Chaoyin Middle School",
    "qingdaoDescription": "Qingdao is a coastal city in Shandong Province, famous for its beer, beaches, and red roof tiles and green trees. I spent my teenage years here, attending New Century School, Chaoyin Middle School, and Qingdao No. 2 High School.",
    "qingdaoMiddleSchool": "Qingdao No. 2 High School",
    "readMore": "Read More",
    "scut": "South China University of Technology",
    "scutDescription": "South China University of Technology is a leading university in Guangzhou, specializing in engineering.",
    "welcome": "Welcome to My Website",
    "work": "Work",
    "work2016": "Worked on project Alpha, focusing on mechanical design.",
    "work2019": "Led a team in developing forging solutions for automotive parts.",
    "work2022": "Focused on casting production line optimization and automation.",
    "work2024": "Established European client base and expanded export channels.",
    "workDescription": "This is my professional journey across different companies, displayed along a timeline. Click on any milestone to view more details."
  },
  "de": {
    "about": "Über mich",
    "aboutDescription": "Ich bin Haichuan Yu, ein Maschinenbauingenieur aus Qingdao, China, der sich für Technologie und Innovation begeistert. Derzeit wohne ich in Böblingen, Deutschland, und arbeite bei Bertrandt AG, hauptsächlich an der Entwicklung und Prüfung von elektronischen Steuergeräten für Fahrzeuge sowie an der Forschung und Entwicklung von Prototypenfahrzeugen für OEMs. Ich liebe technologische Innovationen und löse gerne praktische Probleme durch Programmierung und Datenanalyse.\n\nHier sind meine persönlichen Bildungs-, Lebens- und Berufserfahrungen:",
    "aboutTotal": "Über mich - Überblick",
    "boeblingen": "Böblingen",
    "boeblingenFlugfeld": "Altes Flugfeld Gelände von Böblingen",
    "boeblingenMercaden": "Böblingen Mercaden Kaufhaus",
    "boeblingenMotorWorld": "die Motor World von Böblingen",
    "boeblingenWeihnachtsmarkt": "Böblingen Weihnachtsmarkt",
    "boeblingenDescription": "Böblingen, eine Satellitenstadt von Stuttgart, ist eine charmante Kleinstadt mit verwinkelten Gassen. Nördlich der Stadt, in Sindelfingen, befindet sich das größte Werk von Mercedes-Benz.",

    "company_Hongyuan": "Laizhou Hongyuan Schraubstockherstellung GmbH",
    "company_Hongyuan_position": "Praktikant in der Metallverarbeitung",
    "company_Hongyuan_time": "Juni 2011 - Juli 2011",
    "company_Hongyuan_work": "Im Sommer 2011 absolvierte ich ein einmonatiges Praktikum bei der Laizhou Hongyuan Schraubstockherstellung GmbH.",
    "company_Hongyuan_work_detailed": "Die Laizhou Hongyuan Schraubstockherstellung GmbH blickt auf über 50 Jahre Erfahrung in der Schraubstockproduktion zurück und ist ein führendes Unternehmen in der chinesischen Schraubstockindustrie. Das Unternehmen produziert hauptsächlich Schraubstöcke, ADI-Gusseisen (Austempered Ductile Iron), Automobilteile, Baumaschinenteile und Stromversorgungsteile, die in die USA, Kanada, Australien, Japan und EU-Länder exportiert werden.\n\nIm Sommer 2011 absolvierte ich ein einmonatiges Praktikum bei der Laizhou Hongyuan Schraubstockherstellung GmbH. Ich lernte die verschiedenen Prozesse in der Fabrik kennen, von der Primärverarbeitung von Metallrohstoffen über Gießen, Schmieden und Wärmebehandlung. Die Teilnahme an der Produktion gab mir ein tieferes Verständnis für den Maschinenbau und legte eine solide Grundlage für mein Studium des Maschinenbaus an der Universität.",

    "company_Lolin": "Qingdao Lolin Maschinenbau GmbH",
    "company_Lolin_position": "Vertreter in Deutschland",
    "company_Lolin_time": "Juli 2012 - Heute",
    "company_Lolin_work": "Seit meinem Highschool-Abschluss im Jahr 2012 arbeite ich bei Qingdao Lorraine Machinery Co., Ltd. und war als Praktikant, stellvertretender Manager und Spezialist für die Entwicklung des europäischen Marktes tätig.",
    "company_Lolin_work_detailed": "Die 1990 gegründete Qingdao Lolin Maschinenbau GmbH mit Sitz in Qingdao ist weltweit vertreten. Wir exportieren jährlich über 400 Container an OEMs sowie Zulieferer der ersten, zweiten und dritten Ebene in Europa, Japan und den USA. Wir liefern geschmiedete und gegossene Maschinenteile für Landmaschinen, Baumaschinen, Eisenbahnsysteme und Schwerlastkraftwagen.\n\nSeit meinem Abitur 2012 arbeite ich bei der Qingdao Lorin Machinery Co., Ltd. als Praktikant, stellvertretender Manager und Spezialist für die europäische Marktentwicklung. Im Auftrag des Unternehmens baue ich aktiv neue Kunden auf und pflege bestehende Kunden in Deutschland und nehme an internationalen Maschinenbaumessen in Hannover, Düsseldorf und Stuttgart teil.\n\n2018 vertrat ich das Unternehmen gemeinsam mit dem Manager auf der Hannover Messe, pflegte die Beziehungen zu bestehenden Kunden und erkundete neue potenzielle Kunden.\n\n2019 vertrat ich das Unternehmen eigenständig auf der METEC-Gießereimesse in Düsseldorf. Vom Aufbau des Standes über die Anordnung von Exponaten und Broschüren bis zur Koordination der Veranstaltungslogistik und der Kundenbetreuung erledigte ich alles. Diese Messe bereicherte nicht nur meine Erfahrungen, sondern half dem Unternehmen auch, mehrere neue Kunden zu gewinnen.",

    "company_Schaeffler": "Schaeffler AG",
    "company_Schaeffler_position": "Praktikant",
    "company_Schaeffler_time": "Mai 2017 - November 2017",
    "company_Schaeffler_work": "Im Mai 2017 begann ich ein sechsmonatiges Praktikum bei der Schaeffler AG im Rahmen meines Bachelorstudiums. ",
    "company_Schaeffler_work_detailed": "Die Schaeffler AG ist ein Technologieunternehmen, das sich auf Antriebssysteme spezialisiert hat und in den Bereichen Automotive und Industrie tätig ist. Mit einem Jahresumsatz von etwa 13 Milliarden Euro (2016) und über 85.000 Mitarbeitern weltweit hat das Unternehmen seinen Hauptsitz in Herzogenaurach, Bayern, Deutschland.\n\nIm Mai 2017 begann ich ein sechsmonatiges Praktikum bei der Schaeffler AG im Rahmen meines Bachelorstudiums. Ich arbeitete in der Kettenantriebsentwicklung mit dem Ziel, die Prinzipien der Kettenantriebsschwingungen zu verstehen und die Dämpfungswirkung von Absorbern auf Nockenwellen und Kurbelwellen in Automobilmotoren zu untersuchen.\n\nDie Forschung konzentrierte sich auf die Kurbelwellen und Nockenwellen von Motoren dreier verschiedener Automarken. Aufgrund ihrer unterschiedlichen Antriebsprinzipien und Einbaupositionen war eine umfassende Analyse der Arbeitsprinzipien und Wirkungen der Absorber möglich.\n\nDas Zweimassenschwungrad kann Torsionsschwingungen, die durch Unwuchten der Motorrotation verursacht werden, effektiv reduzieren. Es verringert den Stoß beim Ein- und Ausrücken der Kupplung und minimiert Motorschwingungen. Mein Praktikumsziel war es, die Installation von Absorbern (Tilgern) auf Zweimassenschwungrädern zu untersuchen und ihre Wirksamkeit bei der Reduzierung von Kettenantriebsschwingungen mit MATLAB und Simulationssoftware zu analysieren.\n\nDas Projekt umfasste die Ordnungsanalyse rotierender Körper bei verschiedenen Frequenzen, die Fourier-Analyse zur Zerlegung der Bewegung rotierender Objekte in feste Frequenzkomponenten und die Verwendung der internen Simulationssoftware von Schaeffler, DyFaSim, um die Dämpfungswirkung von Absorbern an verschiedenen Automotoren zu analysieren.\n\nDie Forschungsergebnisse wurden in einer PowerPoint-Präsentation vorgestellt. Die Studie zeigte, dass niedrigere Ordnungen die Hauptursache für Schwingungen sind und Absorber mit spezifischer Dämpfung und Resonanzfrequenz Schwingungen effektiv reduzieren können. Zweimassenschwungräder mit Absorbern zeigten eine bessere Unterdrückung von Motorschwingungen im Vergleich zu solchen ohne Absorber.",

    "company_Stabilus": "Stabilus SE",
    "company_Stabilus_position": "Praktikant",
    "company_Stabilus_time": "November 2021 - Juli 2022",
    "company_Stabilus_work": "Im November 2021 begann ich ein achtmonatiges freiwilliges Praktikum bei Stabilus SE während meines Masterstudiums.",
    "company_Stabilus_work_detailed": "Stabilus SE ist ein führender Hersteller von hydropneumatischen Verstellelementen, Hydraulikdämpfern, elektromechanischen Antrieben und Türverstellern für Automotive- und Industrieanwendungen. Mit über 6.000 Mitarbeitern und 16 Produktionsstandorten weltweit hat das Unternehmen seinen Hauptsitz in Koblenz, Deutschland.\n\nIm November 2021 begann ich ein achtmonatiges freiwilliges Praktikum bei Stabilus SE während meines Masterstudiums. Ich arbeitete in der Forschungs- und Entwicklungsabteilung (SDI-Entwicklung Innovation) und beschäftigte mich mit dem \"Silent Railway\"-Projekt, das darauf abzielt, Lärm und Vibrationen in Schienensystemen und deren Kontaktsystemen zu reduzieren.\n\nDas \"Silent Railway\"-Projekt wurde von aktiven Noise-Cancelling-Kopfhörern inspiriert. Indem das Schienensystem als Ganzes betrachtet wird, soll die ANC-Technologie (Active Noise Cancellation) angewendet werden, um Vibrationen und Lärm zu reduzieren und die Lebensqualität der Anwohner zu verbessern. Die Herausforderung besteht darin, dass ANC typischerweise in geschlossenen oder kleinen Bereichen verwendet wird und seine Anwendung auf offene Schienensysteme weitere Forschung erfordert.\n\nNach Projektbeginn habe ich umfangreiche Literatur studiert, darunter Schienensystemstandards, technische Dokumente zu Lärm und Vibrationen sowie Artikel zu ANC. Anschließend habe ich MATLAB und Simulink verwendet, um Simulationsmodelle zu erstellen, verschiedene ANC-Algorithmen einzubetten und deren Leistung zu vergleichen. Wir arbeiteten auch mit ESI zusammen, um deren SimulationX-Software zur Mehrkörpersimulation zu nutzen und die Lärm- und Vibrationsreduktion verschiedener Algorithmen zu testen.\n\nDer Machbarkeitsbericht zeigt, dass das ANC-Konzept auf Schienensimulationsmodelle angewendet werden kann und bestimmte Effekte erzielt. Die Hinzufügung eines PID-Reglers kann die Leistung weiter verbessern.\n\nDie Forschungsergebnisse wurden in einer PowerPoint-Präsentation vorgestellt, und ein Machbarkeitsbericht wurde erstellt. Die Studie analysierte die Auswirkungen verschiedener ANC-Algorithmen in Schienensystemen und kam zu dem Schluss, dass geeignete Aktuatoren benötigt werden, um die erforderlichen Gegenvibrationen zu erzeugen. Aufgrund von Einschränkungen wurden keine physischen Tests an echten Schienen durchgeführt, und es wurden nur Simulationsergebnisse erzielt.",

    "company_Bertrandt": "Bertrandt AG",
    "company_Bertrandt_position": "Entwicklungsingenieur für Fahrzeug Absicherung",
    "company_Bertrandt_time": "Juli 2022 bis jetzt",
    "company_Bertrandt_work": "Nach meinem Masterabschluss in Maschinenbau am Karlsruher Institut für Technologie trat ich im Juli 2022 als Entwicklungsingenieur bei Bertrandt AG in Ehningen ein.",
    "company_Bertrandt_work_detailed": "Bertrandt AG ist ein börsennotiertes Unternehmen, das Ingenieurdienstleistungen im Bereich Maschinenbau anbietet. Mit rund 14.000 Mitarbeitern an über 50 Standorten, hauptsächlich in Europa, aber auch in den USA und China, bedient es Kunden in der Automobil- und Luftfahrtindustrie.\n\nNach meinem Masterabschluss in Maschinenbau am Karlsruher Institut für Technologie trat ich im Juli 2022 als Entwicklungsingenieur bei Bertrandt AG in Ehningen ein.\n\nBei Bertrandt AG arbeitete ich im Projektteam \"CarIT Security Testhouse\". Die Hauptaufgabe bestand darin, die sicherheitsrelevanten Funktionen von elektronischen Steuergeräten (ECUs) für Mercedes-Benz zu entwickeln und zu testen. Dazu gehörte die Verwendung von CANoe zur Erstellung von Testberichten, die Analyse von Fehlern und die Fehlerverfolgung.\n\nJede Woche wurden unterschiedliche Mengen an ECUs an unser Team geliefert. Nach dem Empfang wurden die ECUs mit Jira und Confluence für die Versionsverwaltung registriert. Anschließend wurden die Software- und Hardwareversionen der ECUs ausgelesen, und falls sie nicht den erwarteten Versionen entsprachen, wurden die ECUs mit einem Computer verbunden und mit DTS Monaco neu programmiert, um die korrekten Testversionen sicherzustellen.\n\nEs ist wichtig zu beachten, dass verschiedene ECUs unterschiedliche Bussysteme wie CAN, Flexray oder Ethernet verwenden. Für CAN und Flexray gibt es High- und Low-Leitungen für die Kommunikation, während Ethernet eine Wakeup-Leitung hat. Daher ist die korrekte Identifizierung des Bussystems bei der ECU-Verbindung entscheidend.\n\nNachdem die ECUs korrekt verbunden und programmiert wurden, wurde die entsprechende Testumgebung in CANoe konfiguriert. Unterschiedliche ECUs und Bussysteme erfordern unterschiedliche Testumgebungen. Nach der Konfiguration wurde eine schnelle Überprüfung durchgeführt, um sicherzustellen, dass die ECUs auf die Anfragen der Testumgebung reagieren. Falls nicht, wurde die Einrichtung erneut überprüft.\n\nAnschließend wurden die ECUs einer Debugging-Phase unterzogen, die etwa 20 Testfälle umfasste, die zwischen 5 und 30 Minuten dauerten. Wenn im Debug-Bericht keine kritischen Fehler gefunden wurden, wurde ein vollständiger Test mit 200 bis 500 Testfällen durchgeführt, der 5 bis 10 Stunden dauerte.\n\nDie Testfälle konzentrierten sich auf die Sicherheitsleistung der ECUs. Mercedes-Benz entwickelte das ZenZefi-System, ein zentrales Zertifikatsmanagementsystem (Zentrale Zertifikatsverwaltung). Jede ECU ist mit Zertifikaten vorinstalliert, darunter Root-, Backend-, Intermediate- und ECU-Zertifikate. Eine vollständige Zertifikatskette ist für Sicherheitstests erforderlich.\n\nDie Haupttestpunkte umfassten sichere Variantencodierung, sicheres Programmieren und sichere Bordkommunikation. Zusätzlich wurden Tests wie TLS (Transport Layer Security) und Gateway-Tests durchgeführt.\n\nNach der Erstellung der Testberichte analysierten wir die Fehler und luden die Berichte in das STARC-Fehlerverfolgungssystem von Mercedes-Benz hoch. Anschließend diskutierten wir die Fehlerursachen mit dem Entwicklungsteam und implementierten Verbesserungen.",

    "company_Mercedes": "Mercedes-Benz AG",
    "company_Mercedes_position": "Entwicklungingenieur für Fzg. statische Inbetriebnahme",
    "company_Mercedes_time": "April 2024 - Mai 2025",
    "company_Mercedes_work": "Nach dem \"CarIT Security Testhouse\"-Projekt bei Bertrandt wurde ich zu Mercedes-Benz in Sindelfingen versetzt, wo ich in der Qualitätsmanagementabteilung der Anlauffabrik als E/E Statische Inbetriebnahme Engineer arbeitete.",
    "company_Mercedes_work_detailed": "Mercedes-Benz ist eine deutsche Automobilmarke, die für Luxus und Hochleistung bekannt ist. Der Hauptsitz befindet sich in Stuttgart, Deutschland, und das Unternehmen produziert eine Reihe von Personenkraftwagen und Nutzfahrzeugen. Gegründet im Jahr 1886, hat das Unternehmen einen Jahresumsatz von über 150 Milliarden Euro und mehr als 170.000 Mitarbeiter weltweit.\n\nNach dem \"CarIT Security Testhouse\"-Projekt bei Bertrandt wurde ich zu Mercedes-Benz in Sindelfingen versetzt, wo ich in der Qualitätsmanagementabteilung der Anlauffabrik als E/E Statische Inbetriebnahme Engineer arbeitete. Meine Aufgabe bestand darin, bei der Entwicklung von Prototypenfahrzeugen zu helfen und Probleme mit elektronischen Steuergeräten (ECUs) während der Tests zu analysieren und zu lösen.\n\nIch war für die 223M-Serie bei Mercedes-Benz verantwortlich, zu der die S-Klasse und die Maybach S-Klasse gehören. Für jede Fahrzeugserie sind die Entwicklungsphasen in E-, A- und B-Phasen unterteilt. Die E-Phase ist die Entwicklungsphase, während A und B Vorproduktions-Debugging-Phasen sind, gefolgt von den Pro1- und Pro2-Produktionsphasen. Fahrzeuge in jeder Phase werden in die Anlauffabrik geschickt, um die neuesten Softwareversionen zu testen. Nach Abschluss des Static Debugging, Dynamic Debugging und der erweiterten Funktionstests werden die Fahrzeuge an die Entwicklungsabteilung zur weiteren Prüfung geschickt.\n\nBeim Static Inbetriebnahme wurde der IS-Tester verwendet, ein tragbares Testgerät für automatisierte Tests. Nach dem Anschluss an die OBD-Schnittstelle des Fahrzeugs führt der IS-Tester verschiedene Tests durch. Die Testberichte werden auf die Server von Mercedes-Benz hochgeladen, um analysiert und heruntergeladen zu werden. Die Testskripte sind in NiSP (Neue Intelligente Schnittstelle Programm), einer C-basierten Sprache, geschrieben. Wenn im Testbericht Fehler gefunden werden, die eine weitere Analyse erfordern, werden die Skripte Zeile für Zeile überprüft, und das Entwicklungsteam wird zur Lösung konsultiert.\n\nWährend der Analyse und Behebung von Fehlern in den Testberichten habe ich auch Python-Skripte verwendet, um Fehlermuster und Bearbeitungszeiten in verschiedenen Entwicklungsphasen zu analysieren. Dies half, den Prozess zu optimieren und die Effizienz des Static Debugging und anderer Schritte zu verbessern.",

    "companyB": "Firma B",
    "companyC": "Firma C",
    "companyD": "Firma D",
    "contact": "Kontakt",
    "guangzhou": "Guangzhou",
    "guangzhouDescription": "Guangzhou ist eine bedeutende Stadt im Süden Chinas, das Herz des Perlflussdeltas und bekannt als das 'Tor zu Südchina'. Im Jahr 2012 schrieb ich mich an der Fakultät für Maschinenbau der South China University of Technology ein und studierte dort Prozessanlagen- und Steuerungstechnik.",
    "guangzhouMeishi": "Köstliche Küche aus Guangzhou",
    "guangzhouSCUT": "Technische Universität Südchina",
    "guangzhouBeijingRoad": "Straßenszene der Beijing Road in Guangzhou",
    "SunYatSenHall": "Sun Yat-sen-Gedächtnishalle",
    "home": "Startseite",
    "karlsruhe": "Karlsruhe",
    "karlsruheDescription": "Karlsruhe ist eine Stadt in Deutschland, die für ihre fächerförmige Stadtstruktur und das Bundesgericht bekannt ist. Von 2014 bis 2021 studierte ich Maschinenbau am Karlsruher Institut für Technologie und erhielt dort sowohl einen Bachelor- als auch einen Masterabschluss.",
    "karlsruheMarketSquare": "Marktplatz von Karlsruhe",
    "karlsruheVonOben": "Blick auf die Karlsruhe von oben",
    "karlsruheZKM": "ZKM Medienzentrum" ,
    "kit": "Karlsruher Institut für Technologie",
    "kitDescription": "Das Karlsruher Institut für Technologie ist eine führende technische Universität in Deutschland, bekannt für Forschung und Innovation.",

    "otherCitiesTitle": "Weitere deutsche Städte",
    "othercities": "Weitere deutsche Städte",
    "othercitiesDescription": "Karlsruhe und Böblingen sind die beiden deutschen Städte, in denen ich die meiste Zeit verbracht habe. Daneben habe ich beruflich, privat und zum Besuch von Freunden viele weitere deutsche Städte besucht, jede mit ihrem ganz eigenen Charme.",

    "hamburg": "Hamburg",
    "hamburgDesc": "Hamburg ist eine bekannte Hafenstadt in Norddeutschland mit fast 1,89 Millionen Einwohnern und damit nach Berlin die zweitgrößte Stadt Deutschlands. Während unseres Besuchs besichtigten wir Hamburgs berühmten Hafen, den Fischmarkt und die Miniaturwelt und genossen ein Festmahl mit Hummer.",
    "duesseldorf": "Düsseldorf",
    "duesseldorfDesc": "Die Düsseldorfer Metallurgieausstellung ist die größte Metallurgieausstellung Europas. 2019 hatte ich das Glück, daran teilzunehmen, wodurch ich nicht nur den Charme dieser internationalen Metropole erleben, sondern auch in einem mit einem Michelin-Stern ausgezeichneten Spitzenrestaurant im Stadtzentrum ein Festmahl genießen konnte.",
    "koeln": "Köln",
    "koelnDesc": "Köln ist die viertgrößte Stadt Deutschlands und die größte Stadt Nordrhein-Westfalens. Mit über 2000 Jahren Geschichte zählt sie zu den ältesten Städten Deutschlands. Wir haben den Kölner Dom schon oft besucht und die wunderschöne Landschaft am Rheinufer genossen.",
    "bonn": "Bonn",
    "bonnDesc": "Bonn hat rund 320.000 Einwohner und ist damit (Stand 2023) die 19. größte Stadt Deutschlands. Als ehemalige Hauptstadt des Kurfürstentums Köln und der Bundesrepublik Deutschland ist sie nach wie vor ein wichtiges politisches Zentrum. Das Bundesmuseum für Deutsche Geschichte in Bonn wurde 1994 gegründet und widmet sich der Darstellung der politischen, sozialen und alltäglichen Geschichte der Bundesrepublik Deutschland von 1945 bis heute.",
    "trier": "Trier",
    "trierDesc": "Trier, Deutschlands älteste Stadt, liegt an der Mosel. Gegründet 16 v. Chr., war sie eine wichtige Festung des Römischen Reiches und beherbergt noch heute Relikte wie das Schwarze Tor und die Cäsarthermen. Karl Marx wurde hier 1818 geboren, und sein ehemaliges Wohnhaus ist heute ein Museum. Eine berühmte Bronzestatue von Marx steht im Stadtzentrum und symbolisiert den Einfluss seiner Philosophie und seines revolutionären Gedankenguts.",
    "koenigswinter": "Königswinter",
    "koenigswinterDesc": "Königswinter ist eine Stadt im Kölner Bezirk. Ganz in der Nähe, auf dem Drachenfelsen, steht ein privates Schloss im Villenstil namens Drachenburg (deutsch: Schloss Drachenburg).",
    "stuttgart": "Stuttgart",
    "stuttgartDesc": "Stuttgart liegt im Neckartal im südwestlichen Bundesland Baden-Württemberg, nahe dem Schwarzwald. Sie ist nicht nur die Landeshauptstadt Baden-Württembergs, sondern auch die Hauptstadt des Landkreises Stuttgart und die größte Stadt des Bundeslandes. Zudem ist sie dessen politisches Zentrum. Aufgrund ihrer wirtschaftlichen, kulturellen und administrativen Bedeutung zählt sie zu den bekanntesten Städten Deutschlands. Wir besuchten mehrmals den Stuttgarter Marktplatz, den Tierpark Wilhelma, die berühmte Stadtbibliothek und viele weitere Sehenswürdigkeiten.",
    "ludwigsburg": "Ludwigsburg",
    "ludwigsburgDesc": "Ludwigsburg liegt etwa 12 Kilometer nördlich des Stuttgarter Stadtzentrums und hat rund 100.000 Einwohner. Schloss Ludwigsburg ist eines der größten Barockpaläste Deutschlands. Jedes Jahr findet hier ein großes Kürbisfest statt, bei dem die Besucher Kürbisse bemalen und die Barockgärten in eine bunte Kürbiswelt verwandeln. Inmitten einer wunderschönen Herbstkulisse können die Besucher Figuren und Szenen aus Tausenden von Kürbissen bewundern.",
    "berlin": "Berlin",
    "berlinDesc": "Berlin, die Hauptstadt und größte Stadt Deutschlands, ist ein weltbekanntes Kultur-, Politik-, Medien- und Wissenschaftszentrum. Wir genossen ein Konzert in Berlin, besuchten den Deutschen Bundestag und hatten eine hautnahe Begegnung mit Riesenpandas im Berliner Zoo.",
    "koblenz": "Koblenz",
    "koblenzDesc": "Koblenz ist die drittgrößte Stadt im deutschen Bundesland Rheinland-Pfalz und liegt am Zusammenfluss von Mosel und Rhein. Dieser Zusammenfluss, auch als Deutsche Ecke bekannt, ist ein Wahrzeichen der Region und ein Symbol der deutschen Einheit. Während meines Studiums absolvierte ich ein sechsmonatiges Praktikum bei Stabilus, einem Unternehmen mit Sitz in Koblenz.",
    "hannover": "Hannover",
    "hannoverDesc": "Hannover ist eine Stadt mit einem hochentwickelten Industriesektor und ein Zentrum der deutschen Automobil-, Maschinenbau- und Elektronikindustrie. Sie ist zudem bekannt für ihre zahlreichen Messen. Ich vertrat Qingdao Lolin Mech. auf der Hannover Messe in 2017.",
    "dresden": "Dresden",
    "dresdenDesc": "Dresden ist ein bedeutendes kulturelles, politisches und wirtschaftliches Zentrum in Ostdeutschland. Wir besuchten dort berühmte Sehenswürdigkeiten, darunter den Zwinger, das Dresdner Königliche Schloss und den Dom.",
    "nuernberg": "Nürnberg",
    "nuernbergDesc": "Nürnberg ist die Hauptstadt des Landkreises Mittelfranken in Bayern. Nach dem Zweiten Weltkrieg fanden hier die Nürnberger Prozesse statt, in denen nationalsozialistische Kriegsverbrecher angeklagt wurden. Wir besuchten die Innenstadt und den Nürnberger Zoo.",







    "touristCitiesTitle": "Andere europäische Länder",
    "touristcities": "Andere europäische Länder",
    "touristcitiesDescription": "Neben Deutschland bereiste ich auch einige andere europäische Nachbarländer und lernte dabei verschiedene Sitten und Gebräuche kennen. Im Folgenden stelle ich verschiedene Städte dieser Länder vor, von denen einige für ihre Naturlandschaften, andere für ihre Kulturlandschaften und wieder andere für beides bekannt sind.",

    "france": "Frankreich",


    "project_cadIntro": "Seit meinem Grundstudium in der Uni habe ich verschiedene CAD-Softwareprogramme mit SolidWorks oder Creo PTC genutzt, um Kenntnisse in der CAD-Softwaremodellierung zu erwerben und in Projekten anzuwenden.",

    "projectsOverview": "Projekt Überblick",
    "projectsOverviewText": "Ich habe während meines Studiums, meiner Arbeit und meiner Freizeit an verschiedenen Projekten mitgewirkt. Hier finden Sie Einführungen in Projekte aus verschiedenen Bereichen, von denen ich viel profitiert habe.",

    "projectCAD-1": "Projekt CAD - 1",
    "projectCAD-1Long": "Ich habe in einem Team von fünf Studierenden eine Top-Down Baugruppe als CAD-Modell erstellt und diese in einem Produktdatenmanagement-System (PDM-System) verwaltet. Die Bearbeitung der gestellten Konstruktionsaufgabe ist Teil des in die Lehrveranstaltung Maschinenkonstruktionslehre integrierten CAD- und PDM-Ausbildungskonzeptes. Die für die Aufgabe benötigten Kenntnisse werden im Selbststudium mittels E-Learning erarbeitet und bei der Anwendung gefestigt. In einem Kolloquium werden die Ergebnisse verteidigt und so das Erreichen der Lernziele sichergestellt.\nIn diesem Projekt habe ich unter anderem die folgenden Anforderungen erfüllt: das Prinzip „Referenzen“ erläutern und im CAD-Modell anforderungsgerecht einsetzen; fortgeschrittene Konstruktionselemente erzeugen: das Ziehen-KE, das Zug-Verbund-KE, das Schalen-KE und Bezugskurven; Top-Down-Modelle mit Hilfe Skelett-Technik erstellen und im Team bearbeiten usw. Dies umfasst grundlegende Operationen wie Strecken und Drehen sowie das Konvertieren von 3D-Modellen in 2D-Zeichnungen und das Erstellen von 3D-Modellen aus bestehenden 2D-Zeichnungen.",
    "projectCAD-1Short": "Universität Workshop Projekt zur Maschinen Konstruktionslehre",

    "projectCAD-2": "Projekt CAD - 2",
    "projectCAD-2Long": "Mithilfe von Online-Tutorials erstellte ich mit Creo PTC ein 3D-Modell eines Flugzeugtriebwerks von Grund auf.\nZuerst übte ich das Lesen und Verstehen von CAD-Zeichnungen, beginnend mit einzelnen Bauteilen, mithilfe verschiedener Online-Ressourcen. Anschließend modellierte ich das Triebwerk in Creo PTC. Nach 10 bis 15 Übungseinheiten begann ich mit der Erstellung des 3D-Modells. Dieses umfasste einzelne Schaufeln, den vorderen Teil des Triebwerks, die Brennkammer und schließlich das gesamte Triebwerk.\nDieses persönliche Projekt machte mich nicht nur mit der detaillierten Struktur von Flugzeugtriebwerken – dem Kronjuwel der menschlichen Industrie – vertraut, sondern gab mir auch praktische Erfahrung in der Anwendung der Feinheiten der CAD-Modellierung und legte damit ein solides Fundament für zukünftige Projekte.",
    "projectCAD-2Short": "Flugzeugmotor-Modellierung",

    "projectCAD-3": "Projekt CAD - 3",
    "projectCAD-3Long": "Aufbauend auf meinen Vorkenntnissen in der CAD-Software-Modellierung erstellte ich während meines Praktikums in der Innovationsabteilung „Silent Railway“ von Stabilus mit Creo PTC ein einfaches 3D-Modell des Kontakts zwischen Schienen und Zugrädern. Ziel war die Untersuchung von Methoden zur Geräuschreduzierung, die durch den Kontakt zwischen Rädern und Schienen bei vorbeifahrenden Zügen entsteht. Das Modell zeigte verschiedene Möglichkeiten zur Schwingungsdämpfung auf, darunter Federn, Dämpfer und Energieabsorber, die an den Rädern und sogar an den Schwellen montiert werden.\nDie CAD-Modellierung ermöglicht eine intuitivere Analyse der Möglichkeiten zur Schwingungs- und Geräuschreduzierung vor tatsächlichen praktischen Tests und erleichtert so das Brainstorming und die Suche nach geeigneteren Lösungen.",
    "projectCAD-3Short": "Modellierung von Schienen und Zugrädern",

    "project_vbaIntro": "Ich bin mit den grundlegenden Funktionen von Excel VBA vertraut und nutze es, um Arbeitsabläufe zu automatisieren und zu optimieren und so die Arbeitseffizienz zu steigern.",
    "projectVBA-1": "Projekt VBA",
    "projectVBA-1Long": "Mithilfe von Online-Tutorials habe ich ein Datenbank-Tabellenstruktur-Verwaltungstool mit VBA entwickelt, das CRUD-Operationen (Create, Read, Update, Delete) für Access- oder SQL Server-Datenbanken bietet. Es verbindet sich über ADO (ActiveX Data Objects) mit der Datenbank und führt SQL-Anweisungen aus. Durch dieses Projekt habe ich mich mit den grundlegenden Funktionen von Excel und VBA vertraut gemacht und deren Anwendung sicher beherrscht. Später konnte ich meine VBA-Kenntnisse im Rahmen meines Praktikums und meiner Jobsuche anwenden. Darüber hinaus nutzte ich VBA in meiner Arbeit, um Arbeitsabläufe zu automatisieren und die Arbeitseffizienz zu steigern.",
    "projectVBA-1Short": "VBA-Datenbankverwaltung",


    "project_matlabIntro": "Ich habe die Software MATLAB und Simulink für meine Bachelor- und Masterarbeiten verwendet. Darüber hinaus habe ich MATLAB und Simulink auch für verschiedene Forschungs- und Entwicklungsprojekte während meiner Praktika und meiner beruflichen Tätigkeit eingesetzt.",
    "projectMATLAB-1": "Projekt MATLAB - 1",
    "projectMATLAB-1Long": "In meiner Bachelorarbeit am Institut für Produktionstechnik (WBK) des Karlsruher Instituts für Technologie (KIT) mit dem Titel „Konzipierung eines Digitalen Zwillings für die Lebensdauerüberwachung von linearen Vorschubachsen“ nutzte ich MATLAB, um ein Modell zu erstellen, Daten zu verarbeiten, Diagramme zu erstellen und dieses dynamisch zu aktualisieren. Ich definierte die Eigenschaften der Kugelumlaufspindel, einschließlich ihrer geometrischen Parameter, Materialeigenschaften und Berechnungen der axialen Steifigkeit. Ich verarbeitete Messdaten und berechnete die äquivalente Last, die Betriebsdauer und die erwartete Restlebensdauer des Lagers. Die Daten wurden dabei grafische Darstellungen überwacht.\nUm ein Modell zu erstellen, das die Restlebensdauer einer Axialantriebsachse (das in der Arbeit untersuchte Bauteil ist eine Kugelumlaufspindel) vorhersagen kann, wurde zunächst das notwendige mathematische Modell abgeleitet und anschließend in MATLAB modelliert. Das Hintergrundbild zeigt ein reales Beispiel einer Kugelumlaufspindel, die in einem 3D-Drucker verwendet wird. Dies ermöglicht den Aufbau des Modells und dessen Integration in das digitale Zwillingsmodell der Antriebsachse. (Siehe Abbildung unten.) Das erstellte Modell kann die Restlebensdauer der Antriebsachse in Echtzeit vorhersagen, wodurch die Komplexität der Lebensdauerüberwachung von Bauteilen vereinfacht und die Daten leicht zugänglich gemacht werden. Darüber hinaus kann in nachfolgenden Forschungsarbeiten, sofern die Schnittstelle aufgebaut und der richtige Algorithmus bereitgestellt wird und das Internet der Dinge (IoT) angebunden ist, ein vollständiges digitales Zwillingsmodell generiert und in der realen Produktion angewendet werden.",
    "projectMATLAB-1Short": "Bachelorarbeit",

    "projectMATLAB-2": "Projekt MATLAB - 2",
    "projectMATLAB-2Long": "Meine Masterarbeit entstand am Lehrstuhl für Dynamik des Instituts für Technische Mechanik am Karlsruher Institut für Technologie (KIT). Der Titel lautete: „Parameterstudie zur Unterdrückung reibungserregter Schwingungen mithilfe hochfrequenter Anregung“.\nDie Arbeit stellte die Eigenschaften von Systemen mit einem (DOF) und zwei (DFB) Freiheitsgraden vor und untersuchte, wie die Schwingungsdämpfung in DFB-Systemen durch die Analyse von Parametern und unter Bezugnahme auf Systeme mit einem Freiheitsgrad realisiert werden kann. Während Schwingungen, die durch Trockenreibung in Systemen mit einem Freiheitsgrad verursacht werden, bereits umfassend erforscht wurden, ist die Forschung zu DFB-Systemen unzureichend. Diese Arbeit befasst sich daher primär mit dem Einfluss hochfrequenter Anregung auf die Schwingungsdämpfung in DFB-Systemen und untersucht deren Auswirkungen auf die Systemstabilität.\nMithilfe fortgeschrittener mathematischer und linearer Algebramethoden sowie Modellierung mit MATLAB analysierte die Arbeit die Auswirkungen hochfrequenter externer Anregung mit verschiedenen Parametern wie Masse, Dämpfung und Frequenz auf die Schwingungsreduzierung in DFB-Systemen. Zusammenfassend lässt sich sagen, dass hochfrequente Anregung reibungsinduzierte Schwingungen in Zwei-Freiheitsgrad-Systemen effektiv unterdrücken kann und das Stabilitätsverhalten des Systems anhand der Stabilitätsdiagramme der Mittelwertgleichungen in Zeitlupe unter verschiedenen Anregungszuständen bewertet werden kann. Um die Effektivität der Näherungsmethode zu untersuchen, wurde ein möglicher Zusammenhang zwischen der externen Anregungsfrequenz und den zugehörigen Eigenwerten ermittelt.",

    "projectMATLAB-2Short": "Masterarbeit",

    "projectMATLAB-3": "Projekt MATLAB - 3",
    "projectMATLAB-3Long": "Zur Untersuchung der Entstehungsmechanismen von Zug- und Gleisgeräuschen sowie von Vibrationen und Methoden zur Geräusch- und Vibrationsdämpfung wurden Simulationsmodelle mit MATLAB und Simulink erstellt. Algorithmen verschiedener ANC-Modelle (Active Noise Cancellation) wurden integriert und ihre Vor- und Nachteile verglichen.\nEin LQR-Regler (Low Quality Reduction) für die Zugfederung wurde mit MATLAB-Code implementiert. Durch die Anpassung verschiedener Parameter im Simulink-Modell wurde die Leistungsfähigkeit aktiver und passiver Federungen verglichen und deren Effektivität bei der Vibrations- und Geräuschdämpfung analysiert. Darüber hinaus wurden verschiedene Algorithmen zur aktiven Geräuschreduzierung mit Simulink erstellt und deren Effekte auf die Geräuschreduzierung verglichen.",
    "projectMATLAB-3Short": "Simulation von Schwingungs- und Geräuschreduktionsmodellen für Schienenfahrzeuge",

    "projectMATLAB-4": "Projekt MATLAB - 4",
    "projectMATLAB-4Long": "Während meines Praktikums in der Motorenentwicklung der Schaeffler Gruppe analysierte ich mithilfe von MATLAB Simulationsmodelle zur Schwingungsreduzierung in Kettenantrieben. Konkret führte ich mit MATLAB eine Ordnungsanalyse der Drehzahl eines rotierenden Körpers bei verschiedenen Frequenzen durch. Mithilfe der Fourier-Analyse zerlegte ich die Bewegung des Objekts in mehrere Teilbewegungen unterschiedlicher Frequenzen, um die schwingungsreduzierende Wirkung von Nockenwellen und Kurbelwellen verschiedener Automobilmotoren nach dem Einbau von Energieabsorbern (Tilger) zu analysieren.",
    "projectMATLAB-4Short": "Simulation zur Reduzierung von Motorschwingungen durch Energieabsorber",

    "project_pythonIntro": "Ich nutze Python, um Spiele zu schreiben, Webinformationen zu durchsuchen, Daten zu verarbeiten und zu analysieren sowie die Lebensqualität und die Arbeitseffizienz zu verbessern.",
    "projectPython-1": "Projekt Python - 1",
    "projectPython-1Long": "Ein 2D-Schießspiel, das mit Pygame entwickelt wurde, bei dem der Spieler einen Hasen steuert, der eine Burg vor Dachsen verteidigt, indem er Pfeile abschießt. Der Spieler kann die Figur mit den WASD-Tasten bewegen und mit einem Mausklick Pfeile abschießen, wobei der Abschusswinkel gesteuert wird. Dachse, als Gegner, erscheinen regelmäßig auf der rechten Seite des Bildschirms und bewegen sich nach links, um die Burg anzugreifen, was bei Kontakt zu Gesundheitsverlust führt.",
    "projectPython-1Short": "2D-Schießspiel mit Pygame",

    "projectPython-2": "Projekt Python - 2",
    "projectPython-2Long": "Dieses Projekt erstellt mithilfe von Python einen Crawler für Hotelbewertungen und einen Wortwolkengenerator. Es verwendet hauptsächlich Selenium, um Bewertungen von Booking.com zu extrahieren, verarbeitet die Daten anschließend mit Pandas und generiert positive/negative Wortwolken basierend auf den Bibliotheken NLTK und WordCloud.\nNutzer können den Hotelnamen und die gewünschte Anzahl an Bewertungen eingeben, die das Programm durchsuchen soll, die Ergebnisse als CSV-Datei speichern und Wortwolken generieren, um die Eigenschaften des Hotels visuell darzustellen.",
    "projectPython-2Short": "Hotelbewertungen mit Python Skripten",

    "projectPython-3": "Projekt Python - 3",
    "projectPython-3Long": "Angesichts der schwächelnden Weltwirtschaft ist es unerlässlich, über aktuelle Ereignisse informiert zu bleiben und die neuesten Entwicklungen in der Branche zu verstehen. Daher nutze ich Python-Bibliotheken wie Requests oder Selenium, um die aktuellsten Nachrichten aus verschiedenen Branchen in Deutschland und weltweit von großen Nachrichtenportalen zu durchsuchen. Ich analysiere Nachrichtenartikel anhand von Schlüsselwörtern, extrahiere Zusammenfassungen und Webseitenlinks und erstelle PDF-Berichte, um jederzeit und überall die neuesten Entwicklungen im Blick zu behalten.",
    "projectPython-3Short": "Aktuelle Nachrichten aus der Industrie in Deutschland und weltweit mit Python Skripten",

    "projectPython-4": "Projekt Python - 4",
    "projectPython-4Long": "Während meiner Arbeit an der E/E statischen Inbetriebnahme bei Mercedes-Benz wurde ein Python-Programm eingesetzt, um die Häufigkeit verschiedener Fehler in den elektronischen Steuergeräten der Fahrzeuge in unterschiedlichen Testphasen sowie die durchschnittliche Bearbeitungszeit pro Fahrzeug zu erfassen. Die Ursachen wurden analysiert und Verbesserungsvorschläge erarbeitet. Die Datenbank enthält verschiedene Testprozesse für über hundert Testfahrzeuge mit einer durchschnittlichen Testdauer von über drei Stunden pro Fahrzeug. Abschließend wurden ein Machbarkeitsbericht und Empfehlungen zur Steigerung der Testeffizienz erstellt.",
    "projectPython-4Short": "Zusammenfassung von Arbeitsdetails und Vorschläge zur Verbesserung mit Python",


    "project_othersIntro": "In meinem Berufs- und Privatleben bin ich auch mit vielen anderen Softwareprogrammen in Berührung gekommen und habe sie genutzt, wie z. B. CANoe, DTS Monaco usw.",
    "projectCANoe-1": "Projekt CANoe",
    "projectCANoe-1Long": "CANoe ist ein Softwareentwicklungs- und Testwerkzeug von Vector Informatik. Diese Software wird hauptsächlich von Automobilherstellern und Anbietern elektronischer Steuergeräte eingesetzt. Sie kann für die Entwicklung, Analyse, Simulation, das Testen, die Diagnose und die Inbetriebnahme von Steuergerätenetzwerken oder einzelnen elektronischen Steuergeräten verwendet werden. \nMithilfe von Datenbankdateien der OEMs können wir CANoe-Testumgebungen generieren, um reale oder simulierte Tests von Fahrzeugsteuergeräten durchzuführen und neue Steuergeräte zu entwickeln.\nWährend meiner Zeit bei der Bertrandt Group nutzte ich CANoe, um Cybersicherheitstests an realen Steuergeräte-Prototypen durchzuführen und Testberichte zu erstellen. Darüber hinaus verwendete ich CANoe zur Simulation von Knoten für bestimmte Steuergeräte – ein Verfahren, das als Restbus-Simulation bekannt ist –, um den Status des Sendens und Empfangens von Informationen durch die Steuergeräte zu beobachten.",
    "projectCANoe-1Short": "Testfallbasiertes Testen von Fahrzeugsteuergeräten mit CANoe.",

    "projectDTS-2": "Projekt Softing DTS.monaco",
    "projectDTS-2Long": "DTS.monaco ist ein standardbasiertes Tool (z. B. ODX, OTX und UDS), das alle Aufgaben von der Entwicklung über Tests und Kundendienst bis hin zur Vorfertigung umfassend abdeckt: Diagnose, Analyse, OBD, Flash-Aktualisierung, Messung, Kalibrierung und Restbussimulation. \nWährend meiner Tätigkeit bei der Bertrand Group nutzte ich Monaco zum Auslesen von Steuergerätedaten, zum Flashen, zur Kommunikationsdiagnose usw. \nBei Mercedes-Benz verwendete ich Monaco während der statischen Fahrzeuginbetriebnahme, um mich mit der OBD-Schnittstelle des Fahrzeugs zu verbinden, die Steuergeräte zu flashen und kundenspezifische Variantencodierungen durchzuführen.",
    "projectDTS-2Short": "Verwendung von Softing DTS.monaco für Diagnose, Analyse und das Flashen von Fahrzeugsteuergeräten.",

    "projects": "Projekte",
    "qdTaiDong": "Straßenszene in Taidong, Qingdao",
    "qdez": "Qingdao Nr. 2 Gymnasium",
    "qdezDescription": "Qingdao Nr. 2 Gymnasium ist eine renommierte Sekundarschule in Qingdao, China.",
    "qdShiNan": "Straßenszene im Bezirk Shinan, Qingdao",
    "qingdao": "Qingdao",
    "qingdaoChaoYin": "Qingdao Chaoyin Mittelschule",
    "qingdaoDescription": "Qingdao ist eine Küstenstadt in der Provinz Shandong, die für ihr Bier, ihre Strände, ihre roten Dachziegel und grünen Bäume bekannt ist. Ich habe hier meine Teenagerjahre verbracht und die New Century School, die Chaoyin Middle School und die Qingdao No. 2 Gymnasium besucht.",
    "qingdaoMiddleSchool": "Qingdao Nr. 2 Gymnasium",
    "readMore": "Mehr lesen",
    "scut": "Südchina Technische Universität",
    "scutDescription": "Die Südchina Technische Universität ist eine führende Universität in Guangzhou, spezialisiert auf Ingenieurwissenschaften.",
    "welcome": "Willkommen auf meiner Website",
    "work": "Arbeit",
    "work2016": "Arbeitete an Projekt Alpha mit Fokus auf mechanisches Design.",
    "work2019": "Leitete ein Team zur Entwicklung von Schmiedelösungen für Automobilteile.",
    "work2022": "Fokussiert auf Optimierung und Automatisierung der Gießerei-Produktionslinie.",
    "work2024": "Aufbau eines europäischen Kundenstamms und Erweiterung der Exportkanäle.",
    "workDescription": "Dies ist mein beruflicher Werdegang in verschiedenen Unternehmen, dargestellt entlang einer Zeitachse. Klicken Sie auf einen Meilenstein, um weitere Details zu sehen."
  },
  "zh": {
    "about": "关于我",
    "aboutDescription": "我是余海川，一名来自中国青岛，热爱技术和创新的机械工程师，目前居住在德国伯布林根，在Bertrandt AG工作，主要从事汽车电子控制单元的开发测试以及主机厂原型车辆的研发相关工作。我热爱技术创新，喜欢通过编程和数据分析解决实际问题。\n\n以下是我的个人教育，生活及工作经历:",
    "aboutTotal": "关于我 - 概览",
    "boeblingen": "伯布林根",
    "boeblingenFlugfeld": "伯布林根旧机场区",
    "boeblingenMercaden": "伯布林根梅卡登百货商店",
    "boeblingenMotorWorld": "伯布林根汽车世界",
    "boeblingenWeihnachtsmarkt": "伯布林根圣诞市场",
    "boeblingenDescription": "斯图加特的卫星城市伯布林根，市区街道蜿蜒起伏，是一个别有韵味的小城。城市北边的辛德芬根坐落着梅赛德斯奔驰最大的工厂。",

    "company_Hongyuan": "莱州鸿源台钳制造有限公司 ",
    "company_Hongyuan_position": "金工实习生",
    "company_Hongyuan_time": "2011年6月 - 2011年7月",
    "company_Hongyuan_work": "我于2011年的夏天在莱州鸿源台钳制造公司进行了为期一个月的金工实习。",
    "company_Hongyuan_work_detailed": "莱州鸿源台钳制造有限公司拥有50多年的台虎钳生产历史，是中国台钳生产行业的领军者。目前主要生产台虎钳、奥贝球铁（ADI）、汽车配件、工程机械配件和电力配件等产品，销往美国、加拿大、澳大利亚、日本和欧盟国家。\n\n我于2011年的夏天在莱州鸿源台钳制造公司进行了为期一个月的金工实习，了解到了台钳厂从金属原材料的初级加工，到铸造锻造热处理等的诸多工序流程，参与了生产实践，对于机械制造有了更深层次的理解，也为了大学里的机械制造专业的学习打下了坚实的基础。",

    "company_Lolin": "青岛洛林机械有限公司",
    "company_Lolin_position": "德国代表",
    "company_Lolin_time": "2012年7月 至今",
    "company_Lolin_work": "自2012年高中毕业之后，我便在青岛洛林机械有限公司就职，历任实习生，经理助理，欧洲市场拓展专员等职位。",
    "company_Lolin_work_detailed": "青岛洛林机械有限公司成立于1990年，扎根青岛，业务覆盖全球，主要面向欧洲，日本及美国的主机厂以及一二三级各个级别的供应商每年出口400多个集装箱，提供锻造和铸造机械类零部件，涵盖农业机械，工程器械，铁路系统和重型卡车零件等等。\n\n自2012年高中毕业之后，我便在青岛洛林机械有限公司就职，历任实习生，经理助理，欧洲市场拓展专员等职位。我代表公司积极在德国拓展新客户，维护老客户，参加过汉诺威，杜塞尔多夫，斯图加特等地区的机械制造业国际展销会。\n\n2018年，我与公司经理一道代表公司参展了当年的汉诺威工业博览会,在与公司老客户互通有无的同时，也拓展了新的潜在客户。\n\n2019年，我独自代表公司出席参展了当年的杜塞尔多夫冶金压铸展览会(METEC)。从布展开始准备，陈列展品及宣传册，沟通协调展会各种事项，接待拓展客户，展会结束后首尾，都由我完成。本次展览会不仅使我受益匪浅，还为公司拓展了多个新客户。",

    "company_Schaeffler": "舍弗勒集团",
    "company_Schaeffler_position": "实习生",
    "company_Schaeffler_time": "2017年5月 - 2017年11月",
    "company_Schaeffler_work": "我于2017年5月份开始在舍弗勒公司进行了为期六个月的本科阶段实习。",
    "company_Schaeffler_work_detailed": "舍弗勒集团(Schaeffler AG)是一家专注驱动技术的科技公司, 公司业务涉及汽车、工业等领域，年营业额约130亿欧元(2016年)，全球员工超过85000人，总部位于德国巴伐利亚州黑尔措根奥拉赫市。\n\n我于2017年5月份开始在舍弗勒公司进行了为期六个月的本科阶段实习。我所在的部门为链条传动的研发部门，实习目标为理解链条传动振动的原理并探究吸能器对于汽车发动机的凸轮轴以及曲轴减震的效果。\n\n研究的目标主要是三个不同品牌车型的发动机的曲轴和凸轮轴，因为它们各自的传动原理以及曲轴和凸轮轴的按照位置各不相同，因此可以更全面地分析吸能器的工作原理和效果。\n\n双质量飞轮可以有效降低发动机旋转的不均衡性而造成传动系的扭转振动。一是可以减少离合器在接合或分离时的冲击，另一点是可以减少发动机的震动。而我的实习目标即研究在双质量飞轮上安装吸能器(Tilger)，并通过MATLAB和模拟仿真软件，分析其对于减少链条传动系统振动的帮助。\n\n项目中运用到了对旋转体不同频率转速所做的阶次分析，将旋转物体的运动分解成若干个不同固定频率的分运动的傅里叶分析，以及使用了舍弗勒公司内部的仿真模拟软件DyFaSim，来分析不同的汽车发动机安装吸能器后的减震效果。\n\n最后将研究成果以PPT形式展示汇报。研究表明较低的阶次是振动的主要原因，并且吸能器在具有特定的阻尼度和共振频率时能产生较好的减震效果。加上吸能器的双质量飞轮与没有加的相比，可以更好地抑制发动机振动。",

    "company_Stabilus": "斯泰必鲁斯集团",
    "company_Stabilus_position": "实习生",
    "company_Stabilus_time": "2021年11月 - 2022年7月",
    "company_Stabilus_work": "我于2021年11月份开始在斯泰必鲁斯公司进行了为期八个月的研究生阶段自愿实习。",
    "company_Stabilus_work_detailed": "斯泰必鲁斯(Stabilus SE)在全球拥有 6,000 多名员工和 16 个生产基地，是汽车和工业应用领域液压气动调节元件、液压减振器、机电驱动器和车门调节器的领先制造商。公司在其位于科布伦茨的总部将其自身设备和产品的开发和生产集中在一起。\n\n我于2021年11月份开始在斯泰必鲁斯公司进行了为期八个月的研究生阶段自愿实习。我所在的部门为公司的研发创新部门 (SDI-Entwicklung Innovation)。 实习的主要内容为对于公司的创新项目\"Silent Railway\"的支持，即对于铁路列车，轨道及其接触系统的噪音和振动控制的研究。\n\n\"Silent Railway\"项目的灵感来自于主动降噪耳机。如果把铁轨及其系统想象成一个整体，则该项目试图给铁轨系统带上一个主动降噪耳机，从而减少振动产生的噪音，使得周围的居民生活质量提高。课题的难点则在于主动降噪(ANC, Active Noise Cancellation)的绝大多数应用场景都是封闭或较小的区域，而对于铁轨这种开放式区域是否适用该技术，值得进一步研究。\n\n开始项目后我先阅读了大量的相关文献，其中既包括铁路系统的各种标准，噪音及振动的相关技术文献，也有主动降噪技术的相关文章。之后便运用MATLAB和Simulink搭建仿真模型，嵌入各种不同的ANC模型的算法，并比较它们相互的优劣。同时我们还与ESI公司合作，利用他们的SimulationX多体模拟仿真测试软件，来测试不同算法的减振降噪效果。\n\n可行性报告显示，ANC的减振降噪概念可以运用到铁轨的仿真模型中并取得一定的效果，如果同时加入PID控制器则可以的达到更好的效果。\n\n最后将研究成果以PPT形式展示汇报，并且生成了一份可行性报告。研究分析了各种不同的ANC算法应用在铁轨系统中的效果，并指出，需要找到合适的执行器来生成所需要的抑制振动的反向振动。并且由于条件所限，并没能进行对于铁轨的实物研究，只有仿真模拟结果。",

    "company_Bertrandt": "伯特兰集团",
    "company_Bertrandt_position": "汽车电控单元安全测试研发工程师",
    "company_Bertrandt_time": "2022年7月 至今",
    "company_Bertrandt_work": "在卡尔斯鲁厄理工学院机械制造专业研究生毕业之后，我于2022年7月入职埃宁根的伯特兰集团，担任研发工程师。",
    "company_Bertrandt_work_detailed": "伯特兰集团(Bertrandt AG)是一家位于巴登-符腾堡州埃宁根(Ehningen)的提供机械工程方面研发服务的上市公司。约有 14000 名员工在 50 多个地点工作，主要位于欧洲，但也在美国和中国，同时还为汽车和飞机行业的客户提供服务。\n\n在卡尔斯鲁厄理工学院机械制造专业研究生毕业之后，我于2022年7月入职埃宁根的Betrandt AG，担任研发工程师。\n\n在伯特兰集团我在项目组\"CarIT Security Testhouse\"工作。项目主要内容是为主机厂梅赛德斯奔驰公司研发测试不同的车辆电子控制单元(ECU, Electronic Control Unit)。具体为在特制的测试台架上研发测试ECU的安全性能相关的功能，利用CANoe生成测试报告，分析报告中的错误，并且进行错误分析及追踪。\n\n每周会有不同数量的ECU运送到我们项目组来进行测试。在ECU被接收到之后，首先会进行登记，我们会用到Jira以及Confluence来进行版本管理以及ECU的登记。之后会对ECU的软件版本和硬件版本进行读取，如果与预期的不一样，则需要将ECU与电脑连接，并通过DTS Monaco进行ECU的程序刷斜，以使其拥有正确的测试用软件及硬件版本。\n\n需要注意的是不同的ECU拥有不同的总线通信系统CAN， Flexray或者是Ethernet。对于前两者会有High和Low两条线来用于通信，Ethernet则是有一个Wakeup Line。因此在ECU连接时需要注意总线的区分。\n\n在ECU正确连接及刷写完毕之后，需要在CANoe中配置正确的测试环境。不同的ECU以及总线通信系统需要不同的测试环境。配置完成之后会简单检查一下ECU是否会对测试环境的询问做出应答，如果没有，则需要重新检查一遍\n\n随后会在测试环境中首先进行ECU调试，这里会有大概20个测试用例，持续时间5到30分钟不等。如果调试过后生成的测试报告里没有严重的错误，则可以进行ECU的完整测试，大概200至500个测试用例，其时长为5到10个小时不等。\n\n具体的测试用例的内容则会集中于ECU的安全性能。奔驰公司自己研发了ZenZefi系统，即中央证书管理系统(Zentrale Zertifikatsverwaltung)。每一个ECU都预先安装了证书,分别是Root(根证书)，Backend(后端证书)，Intermediate(中间证书)和ECU证书。如果没有一个完整的证书链，则该ECU无法进行安全测试。\n\n安全变体编码，安全程序刷写以及安全机载通信，是主要的测试项目。除此之外还会进行TLS(Transport Layer Security, 传输层安全)测试，Gateway Test(网关测试)等一些其他测试。\n\n在测试报告生成之后，我们会对其进行错误分析，并利用奔驰公司的STARC错误追踪登记系统进行报告上传，并与研发同事讨论分析错误原因，进行改进。",

    "company_Mercedes": "梅赛德斯奔驰集团",
    "company_Mercedes_position": "汽车调试研发工程师",
    "company_Mercedes_time": "2024年4月 - 2025年5月",
    "company_Mercedes_work": "在Bertrandt的\"CarIT Security Testhouse\"项目结束后，我被外派到位于Sindelfingen的梅赛德斯奔驰公司，就职于质量管理部门的增产工厂(Anlauffabrik)，从事车辆静态调试工程师的工作。",
    "company_Mercedes_work_detailed": "梅赛德斯奔驰(Mercedes-Benz)是一家以豪华和高性能著称的德国汽车品牌，总部位于德国斯图加特，旗下产品有各式乘用车、中大型商用车辆。公司成立于1886年，年营业额超过1500亿欧元，全球范围有超过17万名员工。\n\n在Bertrandt的\"CarIT Security Testhouse\"项目结束后，我被外派到位于Sindelfingen的梅赛德斯奔驰公司，就职于质量管理部门的增产工厂(Anlauffabrik)，从事车辆静态调试工程师的工作，协助研发原型车辆并且对于汽车电子控制单元在测试过程中出现的问题进行分析解决。\n\n我所负责的项目为奔驰公司的223M系列，即对S级以及迈巴赫S级轿车进行静态调试。对于一个系列的车型，通常会根据研发阶段分为E，A和B阶段。E阶段即研发阶段，A和B则为正式量产之前的调试阶段，之后会进行到Pro1和Pro2正式生产阶段。每一个阶段都会有若干车辆运送到增产工厂以测试最新的软件版本，在包括静态调试，动态调试以及扩展功能测试在内的调试工作完成之后，车辆会被送到研发部门进行下一阶段测试。\n\n静态调试用到了奔驰的IS-Tester，这是一个专门用于自动化测试的手提式便携测试仪。在与车载OBD接口连接之后，IS-Tester即可以开始对被测车辆进行不同的测试。测试完成后的报告会上传到奔驰的服务器以供分析及下载。测试脚本是基于C语言开发的NiSP(Neue Intelligente Schnittstelle Programm)语言。如果测试报告中有需要进一步分析的错误，则会对生成报告的脚本逐行检视，并联系研发部门同事分析解决。\n\n在分析测试报告的错误并解决的同时，我也利用Python脚本对不同研发阶段的各个车辆的错误情况及错误处理时间进行了分析，以便优化流程，更高效地进行静态调试及其他步骤的工作。",

    "companyB": "公司 B",
    "companyC": "公司 C",
    "companyD": "公司 D",


    "contact": "联系我",
    "guangzhou": "广州",
    "guangzhouDescription": "广州是中国南方的重要城市，珠江三角洲的中心，被誉为“南中国之门”。我于2012年入学华南理工大学机械学院就读过程装备与控制工程专业。",
    "guangzhouMeishi": "广州美食",
    "guangzhouSCUT": "华南理工大学",
    "guangzhouBeijingRoad": "广州北京路街景",
    "SunYatSenHall": "中山纪念堂",
    "home": "首页",
    "karlsruhe": "卡尔斯鲁厄",
    "karlsruheDescription": "卡尔斯鲁厄是德国的一座城市，以其扇形城市布局和联邦法院而闻名。我在2014至2021年之间在卡尔斯鲁厄理工学院就读机械制造专业并获得学士和研究生学位。",
    "karlsruheMarketSquare": "卡尔斯鲁厄市集广场",
    "karlsruheVonOben": "俯瞰卡尔斯鲁厄",
    "karlsruheZKM": "媒体艺术中心 ZKM" ,
    "kit": "卡尔斯鲁厄理工学院",
    "kitDescription": "卡尔斯鲁厄理工学院是德国顶尖的技术大学，以研究和创新闻名。",

    "otherCitiesTitle": "其他德国城市",
    "othercities": "其他德国城市",
    "othercitiesDescription": "卡尔斯鲁厄和伯布林根是我在德国呆过的时间最长的两个城市。除此之外，我还因为工作，度假，拜访朋友等原因，到过很多其他的德国城市，它们各自都有自己吸引人的地方。",

    "hamburg": "汉堡",
    "hamburgDesc": "汉堡是德国北部著名的港口城市，拥有近189万人口，是仅次于柏林的德国第二大城市。我们去汉堡参观了当地著名的港口，鱼市，微缩景观世界，还品尝了龙虾海鲜大餐。",
    "duesseldorf": "杜塞尔多夫",
    "duesseldorfDesc": "杜塞尔多夫冶金展是欧洲最大的冶金展览。2019年我有幸参展的同时，也领略这座国际化大都市的风采，并在市中心享用了米其林推荐高端餐厅的盛宴。",
    "koeln": "科隆",
    "koelnDesc": "科隆是德国第四大城市，北莱茵-威斯特法伦州最大的城市，它已有2000多年的历史，是德国最古老的城市之一。我们曾多次参观科隆大教堂，并在莱茵河两岸欣赏美丽风光。",
    "bonn": "波恩",
    "bonnDesc": "波恩人口约32万，为德国第19大都市（截至2023年）。曾经为科隆选侯国与西德的首都，至今仍是德国重要的政治中心。联邦德国历史博物馆位于波恩，成立于1994年，专注于展示1945年至今德国联邦共和国的政治、社会与日常生活历史。",
    "trier": "特里尔",
    "trierDesc": "特里尔是德国最古老的城市，位于摩泽尔河畔，建于公元前16年，古罗马时期曾为帝国重要据点，保留有黑城门、凯撒浴场等遗迹。卡尔·马克思于1818年出生于此，其故居现为博物馆，市中心还有一座著名的马克思铜像，象征其哲学与革命思想的影响。",
    "koenigswinter": "柯尼希斯温特",
    "koenigswinterDesc": "柯尼希斯温特是科隆行政区的一个城市，它附近的龙岩山上有一座私人别墅式的城堡，名为龙堡(德语：Schloss Drachenburg)。",
    "stuttgart": "斯图加特",
    "stuttgartDesc": "斯图加特位于德国西南部的巴登-符腾堡州中部内卡河谷地，靠近黑林山。不仅是该州的州首府，也是斯图加特行政区首府和该州的第一大城市。同时也是该州的政治中心。由于其在经济、文化和行政方面的重要性，是德国最知名的城市之一。我们多次在斯图加特的中心广场，Wilhelma动物园，著名的市立图书馆等等参观游览。",
    "ludwigsburg": "路德维希堡",
    "ludwigsburgDesc": "路德维希堡位于斯图加特市中心以北约12千米处，人口约10万人。路德维希堡宫是德国最大的巴洛克式宫殿建筑之一，每年那里都会举行盛大的南瓜节，人们把南瓜乔装打扮一番，巴洛克花园化身为一座充满南瓜艺术的世界，观众可以在绚丽的秋日氛围中邂逅由数以千计的南瓜拼塑而成的角色与场景。",
    "berlin": "柏林",
    "berlinDesc": "柏林是德国首都及最大城市，是一世界性的文化、政治、媒体和科学之都。我们在柏林欣赏了演唱会，参观了德国议会并且在柏林动物园近距离与大熊猫接触。",
    "koblenz": "科布伦茨",
    "koblenzDesc": "科布伦茨是德国莱茵兰-普法尔茨州的人口第三多的城市，位于摩泽尔河与莱茵河交汇处。两河汇流之处，称德意志之角，为当地名胜，是德意志统一的象征。我曾在位于该城市的斯泰必鲁斯公司进行了为其半年的研究生阶段的实习工作。",
    "hannover": "汉诺威",
    "hannoverDesc": "汉诺威是工业制造业高度发达的城市，是德国的汽车、机械、电子等产业中心，以承办商业博览会而闻名。我曾代表青岛洛林机械公司参加了2017年的汉诺威展览会。",
    "dresden": "德累斯顿",
    "dresdenDesc": "德累斯顿是德国东部重要的文化、政治和经济中心。我们在此参观了著名的景点有茨温格宫，德累斯顿王宫以及大教堂等等。",
    "nuernberg": "纽伦堡",
    "nuernbergDesc": "纽伦堡是是德国巴伐利亚州中弗兰肯行政区的中心城市，第二次世界大战结束之后曾在此举行针对纳粹德国战犯的纽伦堡审判。我们在此参观了市区，以及纽伦堡的动物园。",






    "touristCitiesTitle": "其他欧洲国家",
    "touristcities": "其他欧洲国家",
    "touristcitiesDescription": "除了德国之外，我还游历了周边若干其他的欧洲国家，体验了不一样的风土人情。下面我会介绍去过的这些国家里的不同城市，有些以自然风光而闻名，有些以人文景观著称，有些甚至兼而有之。",

    "france": "法国",


    "projectsOverview": "项目概览",
    "projectsOverviewText": "在我的学习，工作和业余生活中，我参与进行了若干项目。这里你可以看到各个不同领域的项目的介绍，我从中受益匪浅。",

    "project_cadIntro": "自大学本科起，使用了多种CAD软件，例如SolidWork或者Creo PTC学习并实践了CAD软件建模的相关知识及项目。",

    "projectCAD-1": "CAD项目 - 1",
    "projectCAD-1Long": "本人在一个由五名学生组成的团队中，创建了一个自上而下的 CAD 模型，并在产品数据管理系统 (PDM 系统) 中进行管理。给定设计任务的处理是机械设计理论课程中融入的 CAD 和 PDM 培训概念的一部分。任务所需的知识是通过E-Learning学习自学获得的，并通过Creo PTC软件应用得到巩固。在座谈会上对结果进行答辩，以确保实现学习目标。\n在该项目中我都达到了包括但不限于如下的要求:解释产品数据管理系统的任务和可能性;创建进阶的CAD模型元素：拉动特征、拉伸混合特征、壳特征和基准曲线;在模型中创建参数和关系等等。\n通过大学本科阶段的该项目的学习，我不仅获得了团队分工协作进行产品创造管理的知识和经验，更锻炼了CAD软件建模的能力，包括基础的拉伸旋转等操作，以及3D模型转2D图纸，还有通过现有的2D图纸绘制3D模型，Creo PTC里面基础的以及大多数进阶操作都不在话下。",
    "projectCAD-1Short": "大学机械设计理论课程项目",

    "projectCAD-2": "CAD项目 - 2",
    "projectCAD-2Long": "利用网络的教学资源，使用Creo PTC从零开始制作了一个飞机引擎的3D模型。\n首先我通过若干的网络教学资源，从单个零件开始，练习阅读并理解CAD平面图纸，然后在Creo PTC软件中建模。在进行了10到15个练习之后，开始了制作飞机引擎3D模型的过程。先是比如单个的发动机叶片，然后发动机的前半部分，然后是燃烧室，最后是发动机的整体。\n这个个人项目不光让我熟悉了飞机发动机这个人类工业领域皇冠上的明珠的细节构造，更实际熟练应用了CAD软件建模的方方面面的细节，为之后的其他可能的项目打好了基础。",
    "projectCAD-2Short": "飞机引擎建模",

    "projectCAD-3": "CAD项目 - 3",
    "projectCAD-3Long": "有了之前的CAD软件建模经验，在斯泰必鲁斯的\"Silent Railway\"创新项目部门进行实习期间，我利用Creo PTC建立了一个简单的铁轨和火车车轮接触的立体模型，用以研究能够减少列车驶过时车轮与铁轨接触导致的噪音产生量的方法。通过模型可以看出有多种可能的减振方法，包括弹簧，阻尼器，安装于车轮甚至铁轨枕木上的能量吸收器等等。\n通过CAD的建模，可以让人们在实际实物测试之前，更直观地分析，有哪些减振降噪的可能性，进行头脑风暴，找到更适合的解决方案",
    "projectCAD-3Short": "铁轨及列车车轮建模",

    "project_vbaIntro": "熟悉使用Excel VBA的基本操作，运用其自动化优化工作流程，提高工作效率。",
    "projectVBA-1": "VBA项目",
    "projectVBA-1Long": "利用网络教程使用VBA程序学习并制作数据库表结构管理软件，提供了 增、删、改、查 相关的操作，可以用于 Access 或 SQL Server 数据库。它通过ADO（ActiveX Data Objects）连接数据库，并执行SQL语句进行操作。通过该项目熟悉并可以熟练运用Excel以及VBA的各项基本操作。后续凭借对VBA的熟悉，我将其运用到了自己找实习和工作的过程当中，除此之外，还在工作中使用VBA，对工作流程进行了自动化，提高了工作效率。",
    "projectVBA-1Short": "VBA数据库管理",

    "project_matlabIntro": "使用MATLAB以及Simulink软件，辅助完成了本科及研究生的毕业论文，除此之外，还在实习和工作中运用MATLAB及Simulink进行了若干研发工作。",

    "projectMATLAB-1": "MATLAB项目 - 1",
    "projectMATLAB-1Long": "在我的本科毕业论文，即在卡尔斯鲁厄理工学院的生产工程研究所(wbk, Institut für Produktionstechnik)完成的，题目是《用于线性进给轴寿命监控的数字孪生设计》的论文中，用 MATLAB建立模型,进行数据处理、绘图、动态更新，定义滚珠丝杠（Ball Screw）的特性，包括其几何参数、材料属性以及轴向刚度计算,处理测量数据并计算轴承的等效载荷，使用寿命及预期剩余寿命，并监控数据绘图。\n为了能够建立预测轴向进给轴(论文中研究的零件为滚珠丝杠)的剩余使用寿命的模型，首先推导出了必须的数学模型，并在MATLAB建模。背景中的图片为一个在3D打印机中运用的滚珠丝杠的实际案例。由此可以建立模型并使之成为进给轴数字孪生模型的一部分。(见下图图例)\n建立起的模型可以实时预测进给轴的剩余使用寿命，简化了零件使用寿命监测的复杂性，并使数据随时可用，并且在后续研究中，只要搭建接口并提供正确算法，连接物联网 (IoT)，即可生成一个完整的数字孪生模型，运用到实际生产中。",
    "projectMATLAB-1Short": "本科毕业设计",

    "projectMATLAB-2": "MATLAB项目 - 2",
    "projectMATLAB-2Long": "我的研究生毕业论文是在卡尔斯鲁厄理工学院的工程力学研究所动力学部门完成的，题目是《利用高频激励抑制摩擦引起的振动的参数研究》。\n论文介绍了单自由度系统和双自由度系统的特性，以及通过参数研究并参照单自由度系统，来解决双自由度系统振动抑制的问题。目前有很多对于单自由度系统由干性摩擦引起的振动的研究，但是双自由度系统的研究却有不足。论文主要尝试利用高频激励来研究其对于双自由度系统振动抑制的效果，同时也探究了高频激励对于系统的稳定性的影响。\n论文利用高等数学及线性代数方法，使用MATLAB建模，分析了有不同的质量，阻尼以及频率等参数的高频外部激励对于双自由度系统减振效果的影响，并且得出结论: 采用高频激励可以有效抑制两自由度系统的摩擦诱发振动，可以使用不同激励状态下的慢运动平均方程的稳定性图来评估系统的稳定性行为。为了探讨近似方法的有效性，找到了外部激励频率和相应特征值之间的可能关系。",
    "projectMATLAB-2Short": "研究生毕业设计",

    "projectMATLAB-3": "MATLAB项目 - 3",
    "projectMATLAB-3Long": "为了对列车和轨道噪音振动产生机制及抑制噪音振动的方法进行研究，运用MATLAB和Simulink搭建仿真模型，嵌入各种不同的ANC模型的算法，并比较它们相互的优劣。\n使用MATLAB代码建立了列车悬架的 LQR 控制器，通过对Simulink模型中的不同参数进行调整，从而来比较主动/被动悬架的性能，分析抑制振动及噪音的效果。此外使用Simulink建立了不同的主动降噪算法模型，对降噪效果进行比较。",
    "projectMATLAB-3Short": "铁路减振降噪模型模拟仿真",

    "projectMATLAB-4": "MATLAB项目 - 4",
    "projectMATLAB-4Long": "在舍弗勒集团发动机研发部门实习期间，运用MATLAB，对仿真模型进行分析，用以减少链条传动系统的振动。具体使用了MATLAB对旋转体不同频率转速做了阶次分析，通过傅里叶分析将物体运动分解成若干个不同频率的分运动，来分析不同品牌汽车发动机的凸轮轴以及曲轴在安装了吸能器(Tilger)之后的减振效果。",
    "projectMATLAB-4Short": "发动机吸能器减振模拟仿真",

    "project_pythonIntro": "使用Python编写游戏，爬取网页信息，处理分析数据，提高生活乐趣和工作的效率。",
    "projectPython-1": "Python项目 - 1",
    "projectPython-1Long": "使用 pygame 编写的 2D 射击游戏，玩家控制一只兔子（Bunny），通过射箭攻击来保卫城堡不受獾（Badgers）的袭击。玩家控制角色，可以使用 WASD 键移动，鼠标点击发射弓箭并控制发射角度，獾作为敌人定期从屏幕右边生成并向左移动攻击城堡，受到獾的攻击会损失生命值。",
    "projectPython-1Short": "使用 pygame 编写的 2D 射击游戏",

    "projectPython-2": "Python项目 - 2",
    "projectPython-2Long": "使用python代码生成一个酒店评论爬虫和词云生成工具，主要使用Selenium从Booking.com网站抓取评论，然后使用Pandas处理数据，并基于NLTK和WordCloud库生成正面/负面词云图。\n用户可以自行输入酒店名称以及想要获取的评论数目，供程序抓取评论，并将结果保存为csv格式数据，生成词云，以供用户直观地感受酒店的特点。",
    "projectPython-2Short": "使用python爬取酒店评价",

    "projectPython-3": "Python项目 - 3",
    "projectPython-3Long": "在全球经济形势低迷的大背景下，需要每天紧跟时事动态，了解产业界的最新进展，因此我使用python的库requests 或 selenium 爬取各大门户网站的与德国及全球不同产业界相关的最新新闻; 解析符合关键词的新闻，提取摘要以及网页链接;生成 PDF 报告，随时随地掌握最新动态。",
    "projectPython-3Short": "使用python爬取德国及全球工业行业最新信息",

    "projectPython-4": "Python项目 - 4",
    "projectPython-4Long": "在梅赛德斯奔驰公司的车辆静态调试工作期间利用python编写程序，总结在车辆测试的不同阶段车内电子控制单元出现不同的错误的频率，以及每辆车的平均处理时长，分析原因并提出改进意见。数据库包含超过百辆的测试车辆的各个测试过程，以及平均每辆车测试时长超过3个小时，最后制作了可行性报告和改进意见，用以提升测试的效率。",
    "projectPython-4Short": "使用python总结工作细节并提出改进建议",

    "project_othersIntro": "在工作和生活中，我还接触并使用了很多其他的软件，比如CANoe，DTS Monaco等等。",
    "projectCANoe-1": "CANoe 项目",
    "projectCANoe-1Long": "CANoe是Vector Informatik所开发的软件开发及测试工具。此软件主要是用在汽车制造商以及电子控制器供应商，可用在电子控制器网络或个别电子控制器的开发、分析、模拟、测试、诊断及启动。\n借助于主机厂提供的数据库文件，我们可以生成CANoe的测试环境，从而进行真实的或者模拟的车辆电子控制单元的测试，研发新型的ECU。\n在伯特兰集团工作期间，我使用CANoe对真实的ECU原型机进行了网络安全方面的测试，并生成了测试报告。除此之外还利用CANoe模拟生成某些ECU的节点，即所谓的Restbus Simulation，来观测ECU的收发信息等的状态。",
    "projectCANoe-1Short": "使用CANoe对车辆电子控制单元进行基于测试用例的测试。",

    "projectDTS-2": "Softing DTS.monaco 项目",
    "projectDTS-2Long": "DTS.monaco是基于标准的(例如ODX、OTX和UDS)工具，全面涵盖了所有从开发，测试，售后到预制造的工作任务：诊断，分析，OBD，Flash刷新，测量，标定和残余总线仿真。\n在伯特兰集团工作时，我使用Monaco对ECU进行了数据的读取，刷写，通信诊断等等操作。\n在奔驰集团对车辆进行静态调试时，我使用Monaco，连接车上的OBD接口，对车内的ECU进行刷写，以及定制化变体编码(Variant Coding).",
    "projectDTS-2Short": "使用Softing DTS.monaco对车辆电子控制单元进行诊断，分析，ECU刷写等操作。",



    "projects": "项目",
    "qdTaiDong": "青岛台东街景",
    "qdez": "青岛二中",
    "qdezDescription": "青岛二中是中国青岛的一所著名中学。",
    "qdShiNan": "青岛市南区街景",
    "qingdao": "青岛",
    "qingdaoChaoYin": "青岛超银中学",
    "qingdaoDescription": "青岛是山东省的沿海城市，以啤酒、海滩和红瓦绿树闻名。我在这里度过了青少年时光，曾分别就读于新世纪学校，超银中学和青岛二中。",
    "qingdaoMiddleSchool": "青岛二中",
    "readMore": "了解更多",
    "scut": "华南理工大学",
    "scutDescription": "华南理工大学是广州的一所顶尖大学，专注于工程学科。",
    "welcome": "欢迎访问我的网站",
    "work": "工作",
    "work2016": "参与项目 Alpha，专注于机械设计。",
    "work2019": "领导团队开发汽车零件锻造解决方案。",
    "work2022": "专注于铸造生产线优化与自动化。",
    "work2024": "建立欧洲客户基础并拓展出口渠道。",
    "workDescription": "这是我在不同公司职业生涯的时间轴展示。点击任意节点查看详细信息。"
  }
}
