{
  "en": {
    "about": "About",
    "aboutDescription": "I am Haichuan Yu, a mechanical engineer from Qingdao, China, passionate about technology and innovation. Currently residing in Böblingen, Germany, I work at Bertrandt AG, primarily involved in the development and testing of automotive electronic control units and the R&D of prototype vehicles for OEMs. I love technological innovation and enjoy solving practical problems through programming and data analysis.\n\nBelow is my personal education, life, and work experience:",
    "aboutTotal": "About Me - Overview",
    "boeblingen": "Böblingen",
    "companyA": "Company A",
    "companyB": "Company B",
    "companyC": "Company C",
    "companyD": "Company D",
    "contact": "Contact",
    "guangzhou": "Guangzhou",
    "guangzhouDescription": "Guangzhou is a major city in Guangdong Province, famous for its trade and cuisine.",
    "home": "Home",
    "karlsruhe": "Karlsruhe",
    "karlsruheDescription": "Karlsruhe is a city in Germany, known for its fan-shaped urban layout and the Federal Court of Justice.",
    "kit": "Karlsruhe Institute of Technology",
    "kitDescription": "Karlsruhe Institute of Technology is a top technical university in Germany, known for research and innovation.",
    "projectA": "Project A",
    "projectALong": "This is the full description of Project A, detailing the background, tech stack, challenges, and outcomes.",
    "projectAShort": "An interesting application",
    "projectB": "Project B",
    "projectBLong": "This is the full description of Project B, elaborating on development ideas, use cases, and user feedback.",
    "projectBShort": "A practical tool",
    "projectC": "Project C",
    "projectCLong": "This is the full description of Project C, highlighting collaboration processes and innovations.",
    "projectCShort": "A team collaboration result",
    "projects": "Projects",
    "qdTaiDong": "Street scene in Taidong, Qingdao",
    "qdez": "Qingdao No.2 High School",
    "qdezDescription": "Qingdao No.2 High School is a prestigious secondary school in Qingdao, China.",
    "qdShiNan": "Street scene in Shinan District, Qingdao",
    "qingdao": "Qingdao",
    "qingdaoChaoYin": "Qingdao Chaoyin Middle School",
    "qingdaoDescription": "Qingdao is a coastal city in Shandong Province, famous for its beer, beaches, and red roof tiles and green trees. I spent my teenage years here, attending New Century School, Chaoyin Middle School, and Qingdao No. 2 High School.",
    "qingdaoMiddleSchool": "Qingdao No. 2 High School",
    "readMore": "Read More",
    "scut": "South China University of Technology",
    "scutDescription": "South China University of Technology is a leading university in Guangzhou, specializing in engineering.",
    "welcome": "Welcome to My Website",
    "work": "Work",
    "work2016": "Worked on project Alpha, focusing on mechanical design.",
    "work2019": "Led a team in developing forging solutions for automotive parts.",
    "work2022": "Focused on casting production line optimization and automation.",
    "work2024": "Established European client base and expanded export channels.",
    "workDescription": "This is my professional journey across different companies, displayed along a timeline. Click on any milestone to view more details."
  },
  "de": {
    "about": "Über mich",
    "aboutDescription": "Ich bin Haichuan Yu, ein Maschinenbauingenieur aus Qingdao, China, der sich für Technologie und Innovation begeistert. Derzeit wohne ich in Böblingen, Deutschland, und arbeite bei Bertrandt AG, hauptsächlich an der Entwicklung und Prüfung von elektronischen Steuergeräten für Fahrzeuge sowie an der Forschung und Entwicklung von Prototypenfahrzeugen für OEMs. Ich liebe technologische Innovationen und löse gerne praktische Probleme durch Programmierung und Datenanalyse.\n\nHier sind meine persönlichen Bildungs-, Lebens- und Berufserfahrungen:",
    "aboutTotal": "Über mich - Überblick",
    "boeblingen": "Böblingen",
    "companyA": "Firma A",
    "companyB": "Firma B",
    "companyC": "Firma C",
    "companyD": "Firma D",
    "contact": "Kontakt",
    "guangzhou": "Guangzhou",
    "guangzhouDescription": "Guangzhou ist eine Großstadt in der Provinz Guangdong, berühmt für Handel und Küche.",
    "home": "Startseite",
    "karlsruhe": "Karlsruhe",
    "karlsruheDescription": "Karlsruhe ist eine Stadt in Deutschland, bekannt für ihr fächerförmiges Stadtlayout und den Bundesgerichtshof.",
    "kit": "Karlsruher Institut für Technologie",
    "kitDescription": "Das Karlsruher Institut für Technologie ist eine führende technische Universität in Deutschland, bekannt für Forschung und Innovation.",
    "projectA": "Projekt A",
    "projectALong": "Dies ist die vollständige Beschreibung von Projekt A, die den Hintergrund, den Technologie-Stack, die Herausforderungen und die Ergebnisse detailliert beschreibt.",
    "projectAShort": "Eine interessante Anwendung",
    "projectB": "Projekt B",
    "projectBLong": "Dies ist die vollständige Beschreibung von Projekt B, die Entwicklungsansätze, Anwendungsszenarien und Nutzerfeedback ausführlich beschreibt.",
    "projectBShort": "Ein praktisches Werkzeug",
    "projectC": "Projekt C",
    "projectCLong": "Dies ist die vollständige Beschreibung von Projekt C, die den Kollaborationsprozess und Innovationen hervorhebt.",
    "projectCShort": "Ein Ergebnis der Teamzusammenarbeit",
    "projects": "Projekte",
    "qdTaiDong": "Straßenszene in Taidong, Qingdao",
    "qdez": "Qingdao Nr. 2 Gymnasium",
    "qdezDescription": "Qingdao Nr. 2 Gymnasium ist eine renommierte Sekundarschule in Qingdao, China.",
    "qdShiNan": "Straßenszene im Bezirk Shinan, Qingdao",
    "qingdao": "Qingdao",
    "qingdaoChaoYin": "Qingdao Chaoyin Mittelschule",
    "qingdaoDescription": "Qingdao ist eine Küstenstadt in der Provinz Shandong, die für ihr Bier, ihre Strände, ihre roten Dachziegel und grünen Bäume bekannt ist. Ich habe hier meine Teenagerjahre verbracht und die New Century School, die Chaoyin Middle School und die Qingdao No. 2 Gymnasium besucht.",
    "qingdaoMiddleSchool": "Qingdao Nr. 2 Gymnasium",
    "readMore": "Mehr lesen",
    "scut": "Südchina Technische Universität",
    "scutDescription": "Die Südchina Technische Universität ist eine führende Universität in Guangzhou, spezialisiert auf Ingenieurwissenschaften.",
    "welcome": "Willkommen auf meiner Website",
    "work": "Arbeit",
    "work2016": "Arbeitete an Projekt Alpha mit Fokus auf mechanisches Design.",
    "work2019": "Leitete ein Team zur Entwicklung von Schmiedelösungen für Automobilteile.",
    "work2022": "Fokussiert auf Optimierung und Automatisierung der Gießerei-Produktionslinie.",
    "work2024": "Aufbau eines europäischen Kundenstamms und Erweiterung der Exportkanäle.",
    "workDescription": "Dies ist mein beruflicher Werdegang in verschiedenen Unternehmen, dargestellt entlang einer Zeitachse. Klicken Sie auf einen Meilenstein, um weitere Details zu sehen."
  },
  "zh": {
    "about": "关于我",
    "aboutDescription": "我是余海川，一名来自中国青岛，热爱技术和创新的机械工程师，目前居住在德国伯布林根，在Bertrandt AG工作，主要从事汽车电子控制单元的开发测试以及主机厂原型车辆的研发相关工作。我热爱技术创新，喜欢通过编程和数据分析解决实际问题。\n\n以下是我的个人教育，生活及工作经历:",
    "aboutTotal": "关于我 - 概览",
    "boeblingen": "伯布林根",
    "companyA": "公司 A",
    "companyB": "公司 B",
    "companyC": "公司 C",
    "companyD": "公司 D",
    "contact": "联系我",
    "guangzhou": "广州",
    "guangzhouDescription": "广州是广东省的主要城市，以贸易和美食而闻名。",
    "home": "首页",
    "karlsruhe": "卡尔斯鲁厄",
    "karlsruheDescription": "卡尔斯鲁厄是德国的一座城市，以其扇形城市布局和联邦法院而闻名。",
    "kit": "卡尔斯鲁厄理工学院",
    "kitDescription": "卡尔斯鲁厄理工学院是德国顶尖的技术大学，以研究和创新闻名。",
    "projectA": "项目 A",
    "projectALong": "这是项目 A 的完整描述，介绍背景、技术栈、遇到的挑战和成果。",
    "projectAShort": "一个有趣的应用",
    "projectB": "项目 B",
    "projectBLong": "这是项目 B 的完整描述，详细阐述开发思路、应用场景和用户反馈。",
    "projectBShort": "一个实用的工具",
    "projectC": "项目 C",
    "projectCLong": "这是项目 C 的完整描述，重点介绍协作流程和创新点。",
    "projectCShort": "一个团队合作成果",
    "projects": "项目",
    "qdTaiDong": "青岛台东街景",
    "qdez": "青岛二中",
    "qdezDescription": "青岛二中是中国青岛的一所著名中学。",
    "qdShiNan": "青岛市南区街景",
    "qingdao": "青岛",
    "qingdaoChaoYin": "青岛超银中学",
    "qingdaoDescription": "青岛是山东省的沿海城市，以啤酒、海滩和红瓦绿树闻名。我在这里度过了青少年时光，曾分别就读于新世纪学校，超银中学和青岛二中。",
    "qingdaoMiddleSchool": "青岛二中",
    "readMore": "了解更多",
    "scut": "华南理工大学",
    "scutDescription": "华南理工大学是广州的一所顶尖大学，专注于工程学科。",
    "welcome": "欢迎访问我的网站",
    "work": "工作",
    "work2016": "参与项目 Alpha，专注于机械设计。",
    "work2019": "领导团队开发汽车零件锻造解决方案。",
    "work2022": "专注于铸造生产线优化与自动化。",
    "work2024": "建立欧洲客户基础并拓展出口渠道。",
    "workDescription": "这是我在不同公司职业生涯的时间轴展示。点击任意节点查看详细信息。"
  }
}
