{
    "aboutTitle": "Über mich - Haichuan Yus persönliche Website",
    "aboutDescription": "Ich bin Haichuan Yu, ein Maschinenbauingenieur aus Qingdao, China, der sich für Technologie und Innovation begeistert. Derzeit wohne ich in Böblingen, Deutschland, und arbeite bei Bertrandt AG, hauptsächlich an der Entwicklung und Prüfung von elektronischen Steuergeräten für Fahrzeuge sowie an der Forschung und Entwicklung von Prototypenfahrzeugen für OEMs. Ich liebe technologische Innovationen und löse gerne praktische Probleme durch Programmierung und Datenanalyse.",
    "aboutExperience": "Hier sind meine persönlichen Bildungs-, Lebens- und Berufserfahrungen:",
    "qingdao": "Qingdao",
    "germany": "Deutschland",
    "HighEducation": "Hochschulbildung",
    "GuangzhouSCUT": "Guangzhou, China - Südchinesische Technische Universität - Bachelor Maschinenbau",
    "KarlsruheKIT": "Karlsruhe, Deutschland - Karlsruher Institut für Technologie - Bachelor und Master Maschinenbau",
    "skills": "Fähigkeiten und Expertise",
    "skill1": "Prinzipien und Anwendungen der Schwingungslehre",
    "skill2": "Maschinelles Design und Simulation",
    "skill3": "Prüfung und Entwicklung von elektronischen Steuergeräten für Fahrzeuge",
    "skill4": "Deutscher und chinesischer Führerschein, mit über 100.000 Kilometern Fahrerfahrung",
    "skill5": "Fließend in Chinesisch, Englisch und Deutsch",
    "skill6": "Programmiersprachen: MATLAB, Python, CANoe, DTS Monaco, JavaScript",
    "skillsMatrixDescription": "Hier ist meine Fähigkeitsmatrix, wobei drei Häkchen für fortgeschrittene Kenntnisse und ein Häkchen für grundlegendes Verständnis und die Fähigkeit zur Durchführung einiger grundlegender Operationen stehen:",
    "interests": "Interessen und Hobbys",
    "interestsDescription": "Ich genieße Inselreisen, spiele Go gegen Computer, schaue Action- und Science-Fiction-Filme, programmiere mit KI, höre chinesische Popmusik und erkunde neue Technologien.",
    "myKita": "Mein Kindergarten: Angeschlossener Kindergarten der Qingdao Preschool Normal School",
    "myKitaDescription": "In der Nähe der Universität Qingdao war das Teilen von Ultraman-Puppen mit meinen Freunden der Ausgangspunkt meiner Kindheit",
    "visitKita": "Besuchen Sie die offizielle Website des Kindergartens",
    "myPrimary": "Meine Grundschule: Qingdao New Century School",
    "myPrimaryDescription": "Von 2000 bis 2006 habe ich hier eine schöne Grundschulzeit verbracht. Meine schulischen Leistungen gehören zu den besten meiner Klasse und ich verfügte über umfassende moralische, intellektuelle, körperliche, ästhetische und berufliche Fähigkeiten. Ich habe die Schule bei Bezirkssportveranstaltungen vertreten.",
    "visitPrimary": "Besuchen Sie die offizielle Website von New Century School",
    "myJuniorHigh": "Meine Mittelschule: Qingdao Chaoyin Mittelschule",
    "myJuniorHighDescription": "Nach drei Jahren Ausbildung hier habe ich eine solide Grundlage für mein Lernen gelegt. Ich war Mitglied des Klassensicherheitsausschusses, Klassensprecher für Physik und übte weitere Positionen aus. Ich habe die Klasse und die Schule bei Programmierwettbewerben und Englisch-Leistungswettbewerben vertreten und bin einer von nur zwei herausragenden Absolventen meiner Klasse, die an der Qingdao-Mittelschule Nr. 2 aufgenommen wurden.",
    "visitJuniorHigh": "Besuchen Sie die offizielle Website von Qingdao Chaoyin Middle School",
    "myHighSchool": "Meine Oberschule: Qingdao Nr.2 Oberschule",
    "myHighSchoolDescription": "Am Fuße des Cigui-Berges und neben dem Jingsi-See verbrachte ich meine Jugend als leidenschaftlicher junger Mann. Ich hatte hier ein arbeitsreiches, aber erfülltes Oberschule-Leben und wurde mit einer Punktzahl von 646 (insgesmat 750 Punkte) in der College-Aufnahmeprüfung (Abitur) an meiner Traumuniversität zugelassen.",
    "visitHighSchool": "Besuchen Sie die offizielle Website von Qingdao Nr.2 Oberschule",
    "boeblingenTitle": "Böblingen",
    "boeblingenDescription": "Ich lebe derzeit in Böblingen, einer charmanten Kleinstadt mit verwinkelten Straßen. Die Stadt Sindelfingen im Norden beherbergt das größte Werk von Mercedes-Benz.",
    "visitBoeblingenWebsite": "Besuchen Sie die Website der Stadt Böblingen",
    "karlsruheTitle": "Karlsruhe",
    "karlsruheDescription": "Ich habe zehn Jahre meines Lebens in dieser Stadt verbracht, von meinen 20ern bis zu meinen 30ern, und sie ist zu meiner zweiten Heimat geworden. Von meiner anfänglichen Naivität bei meiner Ankunft in Deutschland, dem Besuch von Sprachkursen, dem Erlernen der deutschen Sprache, dem Abschluss meines Bachelor- und Masterstudiums in Maschinenbau am Karlsruher Institut für Technologie, dem Erwerb eines deutschen Führerscheins, dem Verlieben, Heiraten und der Geburt einer Tochter hat diese Stadt ein denkwürdiges Jahrzehnt meines Lebens miterlebt.",
    "visitKITWebsite": "Besuchen Sie die Website des Karlsruher Instituts für Technologie",
    "herzogenaurachTitle": "Herzogenaurach",
    "herzogenaurachDescription": "Diese Stadt ist der Sitz von Schaeffler AG, einem renommierten Zulieferer in der Maschinenbaubranche. Ich habe hier mein Pflichtpraktikum in der Antriebsstrang-Forschung und -Entwicklung während meines Bachelorstudiums absolviert.",
    "visitSchaefflerWebsite": "Besuchen Sie die Schaeffler-Website",
    "koblenzTitle": "Koblenz",
    "koblenzDescription": "Diese berühmte deutsche Touristenstadt, am Rhein gelegen und Heimat des Deutschen Ecks, ist der Hauptsitz von Stabilus, einem Hersteller von Luftfedern und Dämpfern. Ich habe hier mein freiwilliges Praktikum in der Innovations- und Forschungsabteilung während meines Masterstudiums absolviert.",
    "visitKoblenzWebsite": "Besuchen Sie die Website der Stadt Koblenz",
    "hannoverTitle": "Hannover",
    "hannoverDescription": "Die Hannover Messe ist die größte Industriemesse Deutschlands. In meiner Freizeit hatte ich das Privileg, ein inländisches Unternehmen auf der Messe zu vertreten, was eine bereichernde Erfahrung war.",
    "visitHannoverMesseWebsite": "Besuchen Sie die Hannover Messe Website",
    "duesseldorfTitle": "Düsseldorf",
    "duesseldorfDescription": "Die Düsseldorfer Metallurgieausstellung ist die größte Metallurgiemesse Europas. Im Jahr 2019 hatte ich die Gelegenheit, die Ausstellung zu besuchen und den Charme dieser internationalen Metropole zu erleben.",
    "visitDuesseldorfMesseWebsite": "Besuchen Sie die Düsseldorfer Messe Website"
  }